[
    {
        "name": "English 9",
        "number": "0012",
        "sections": "14",
        "department": 0,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "All ninth graders begin their work in English with an ungraded writing trimester. The following two trimesters involve the reading and analysis of literary texts, and the study of grammar. Grammar study culminates in April with a grade-wide grammar test.",
        "longinfo": "All ninth graders begin their work in English with an ungraded writing trimester. Students write every day, in class and at home, and in a variety of styles, ranging from dialogues to poems, detailed descriptions to longer personal narratives. Daily writing is accompanied by daily feedback. We teach writing as a process. The class is taken pass/fail, a practice which allows us to keep the focus on the student’s work and the teacher’s feedback, and to give students the space to take risks and experiment. The following two trimesters involve the reading and analysis of literary texts, and the study of grammar. Grammar study culminates in April with a grade-wide grammar test."
    },
    {
        "name": "English 10",
        "number": "0014",
        "sections": "14",
        "department": 0,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Students in tenth grade continue their literary studies in courses designed by their teacher. All tenth grade students study drama, poetry, and prose fiction with with a continuation of our grammar curriculum. As in ninth grade, a grade-wide grammar test is given in April.",
        "longinfo": "Students in tenth grade continue their literary studies in courses designed by their teacher. All tenth grade students study drama, poetry, and prose fiction with with a continuation of our grammar curriculum. As in ninth grade, a grade-wide grammar test is given in April."
    },
    {
        "name": "English 11",
        "number": "0016",
        "sections": "14",
        "department": 0,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "In English 11, genre study intensifies with one trimester units on poetry, drama, and the novel. All English 11 students complete a major research paper that brings together skills they have been working on since ninth grade: close reading, building from evidence to argument, comparative analysis, and independent critical thinking.",
        "longinfo": "In English 11, genre study intensifies with one trimester units on poetry, drama, and the novel. All English 11 students complete a major research paper that brings together skills they have been working on since ninth grade: close reading, building from evidence to argument, comparative analysis, and independent critical thinking. Depending on the class, research engages student in comparative literary-critical analysis, individual author studies, or New Yorker-style profile pieces. Regardless of the project, students work step by step, from searching for, sorting, and synthesizing a range of primary and secondary sources to developing from that material an extended critical-analytical study of their own."
    },
    {
        "name": "AP English",
        "number": "0020",
        "sections": "1",
        "department": 0,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "The curriculum of AP English consists of readings in poetry, Shakespearean drama, the essay, and prose fiction. Works considered in the current school year include The Turn of the Screw, The Tempest, Heart of Darkness, To The Lighthouse, Beloved, King Lear, and Waiting for Godot, among other works. Major units cover satire in its various forms and contemporary critical theory. Extensive written work accompanies the texts and emphasizes analysis of literary themes, styles, and techniques. Students in AP English are required to take the Advanced Placement Examination.",
        "longinfo": "The curriculum of AP English consists of readings in poetry, Shakespearean drama, the essay, and prose fiction. Works considered in the current school year include The Turn of the Screw, The Tempest, Heart of Darkness, To The Lighthouse, Beloved, King Lear, and Waiting for Godot, among other works. Major units cover satire in its various forms and contemporary critical theory. Extensive written work accompanies the texts and emphasizes analysis of literary themes, styles, and techniques. Students in AP English are required to take the Advanced Placement Examination."
    },
    {
        "name": "Senior Electives",
        "number": "0022",
        "sections": "12",
        "department": 0,
        "credits": 0.33,
        "wt": 0.33,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The offerings each trimester cover a broad range of literary periods, themes, and genres. Some courses stress expository or analytic writing; others engage students in writing original poems or short stories. The Department varies electives in response to its own changing composition and the changing needs of our students.",
        "longinfo": "The offerings each trimester cover a broad range of literary periods, themes, and genres. Some courses stress expository or analytic writing; others engage students in writing original poems or short stories. The Department varies electives in response to its own changing composition and the changing needs of our students.\r Senior Electives recently offered:\r 1) Always Be Closing: The Work of David Mamet 2) Cultural Perspectives in Literature\r 3) Shakespeare and the Genres 4) \rMetamorphosis: A Thematic Approach to the Novella 5) Literature and Film 6) \rToni Morrison 7) \rBritish Romanticism: Visions and Revisions 8) \rThe Iliad 9) \rThe Bible as Literature 10) \rThe Short Story 11) \rEmily Dickinson 12) \rBad Guys, Spies, and Private Eyes 13) \rWriting Nature, Writing Ourselves 14) \rNew York Poets\r 15) Poetry Writing: A workshop 16) \rPoets of Moment: Billy Collins, Pablo Neruda, and Naomi Shihab Nye 17) Tolstoy 18) \rNow You See It: Magic and the Magician in Realist Literature 19) Americas: Other Voices in American Fiction 20) \rAnything Goes: British Eighteenth Centuries\r 21) Bad Girls: Exploring Female Misbehavior\r 22) Metamorphosis: A Thematic Approach to the Novella 23) \rPosthumanism: Freaks and Cyborgs"
    },
    {
        "name": "Atlantic World History",
        "number": "0105",
        "sections": "15",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 12,
        "shortinfo": "Atlantic history is the study of the world created by the interaction of peoples in Africa, Europe, and the Americas. This course will examine the migration (both voluntary and involuntary) of people and the exchange of goods, ideas, and practices across and around the Atlantic Ocean. Major themes include the transatlantic slave trade, the rise of colonial societies and Atlantic labor systems, the transformation of Europe through exploration and expansion, the spread of revolutionary ideas, the rise and fall of imperialism in Africa, and the crises of a new global age.",
        "longinfo": "Atlantic history is the study of the world created by the interaction of peoples in Africa, Europe, and the Americas. This course will examine the migration (both voluntary and involuntary) of people and the exchange of goods, ideas, and practices across and around the Atlantic Ocean. Major themes include the transatlantic slave trade, the rise of colonial societies and Atlantic labor systems, the transformation of Europe through exploration and expansion, the spread of revolutionary ideas, the rise and fall of imperialism in Africa, and the crises of a new global age. Students will be asked to investigate the Atlantic world from the various perspectives of those who experienced it and to analyze how historians have interpreted the Atlantic past in different ways. Over the course of the year, students will learn how to weigh evidence and balance these multiple perspectives to develop historical arguments and interpretations. These skills will be refined in three analytical papers, which must be submitted to earn a passing grade for each trimester."
    },
    {
        "name": "AP World History",
        "number": "0106",
        "sections": "2",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "AP World History attempts to cover the entire scope of human history, from the beginnings of the first human civilizations (in approximately 8000 BCE) to the present day. In doing so, our goal is to gain an understanding of the large-scale trends and patterns in human societies, cultures, migrations, technologies, and religions. Our focus is not so much on the specific details of any individual society or culture, although students will learn about the social and political structures of cultures ranging from the ancient Persians to the Mongols to modern China. More importantly, students will learn to see the history of interactions and interrelationships among the peoples of the world in different periods of history. Students should expect to do a significant amount of reading and writing, as well as participating actively in class discussions.",
        "longinfo": "AP World History attempts to cover the entire scope of human history, from the beginnings of the first human civilizations (in approximately 8000 BCE) to the present day. In doing so, our goal is to gain an understanding of the large-scale trends and patterns in human societies, cultures, migrations, technologies, and religions. Our focus is not so much on the specific details of any individual society or culture, although students will learn about the social and political structures of cultures ranging from the ancient Persians to the Mongols to modern China. More importantly, students will learn to see the history of interactions and interrelationships among the peoples of the world in different periods of history. Students should expect to do a significant amount of reading and writing, as well as participating actively in class discussions."
    },
    {
        "name": "AP European History",
        "number": "0107",
        "sections": "1",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "AP European history covers the social, political, economic, and cultural development of Europe from 1450 to the present. Students should be prepared to engage in lively debates and discussions that consider not only the events of the past, but also the different ways in which historians have understood those events. Historiographical trends (Annales, gender, culture) will thus comprise a significant aspect of the course. Students will also be asked to pursue independent research projects and can expect guidance from the instructor as well as a generous amount of room for exploration. Because of the emphasis on writing, students should be ready to devote significant time to the crafting and refining of arguments in essays and papers. The classes are conducted in a seminar-style format, so active class participation is both encouraged and expected.",
        "longinfo": "AP European history covers the social, political, economic, and cultural development of Europe from 1450 to the present. Students should be prepared to engage in lively debates and discussions that consider not only the events of the past, but also the different ways in which historians have understood those events. Historiographical trends (Annales, gender, culture) will thus comprise a significant aspect of the course. Students will also be asked to pursue independent research projects and can expect guidance from the instructor as well as a generous amount of room for exploration. Because of the emphasis on writing, students should be ready to devote significant time to the crafting and refining of arguments in essays and papers. The classes are conducted in a seminar-style format, so active class participation is both encouraged and expected."
    },
    {
        "name": "U.S. History",
        "number": "0108",
        "sections": "14",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course surveys the United States’ past from the colonial period through the modern era. The curriculum examines the physical, demographic and bureaucratic growth of the nation alongside the development of its political, social, economic and cultural institutions and traditions. Students consider the changing roles that gender, race and class have played throughout American history. Exams evaluate conceptual skills as well as analytical abilities and mastery of historical content. Students write three analytical papers, which must be submitted to earn a passing grade for each trimester.",
        "longinfo": "This course surveys the United States’ past from the colonial period through the modern era. The curriculum examines the physical, demographic and bureaucratic growth of the nation alongside the development of its political, social, economic and cultural institutions and traditions. Students consider the changing roles that gender, race and class have played throughout American history. Exams evaluate conceptual skills as well as analytical abilities and mastery of historical content. Students write three analytical papers, which must be submitted to earn a passing grade for each trimester."
    },
    {
        "name": "AP U.S. History",
        "number": "0110",
        "sections": "2",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "This course is designed to provide students with the analytical skills and factual knowledge to deal critically with problems and materials in American history. Students deal with primary sources, are introduced to American historiography, and read numerous scholarly articles and monographs. Emphasis is given to writing historical essays, and students are expected to submit short essays and reports. Students may also have the opportunity to produce a major research paper based on their individual interest in any area of American history. Major themes include the following: the paradoxical growth of freedom and slavery in the American colonies; interaction with Native Americans; republicanism; liberalism and the significance of ideology; expansionism; religion; economic development; sectionalism and patterns of segregation; race, class and gender; reform; political party development; significant issues in diplomacy; the impact of war on American society; contemporary issues in American society; and the growth and development of a democratic culture.",
        "longinfo": "This course is designed to provide students with the analytical skills and factual knowledge to deal critically with problems and materials in American history. Students deal with primary sources, are introduced to American historiography, and read numerous scholarly articles and monographs. Emphasis is given to writing historical essays, and students are expected to submit short essays and reports. Students ﻿may also have the opportunity to produce a major research paper based on their individual interest in any area of American history. Major themes include the following: the paradoxical growth of freedom and slavery in the American colonies; interaction with Native Americans; republicanism; liberalism and the significance of ideology; expansionism; religion; economic development; sectionalism and patterns of segregation; race, class and gender; reform; political party development; significant issues in diplomacy; the impact of war on American society; contemporary issues in American society; and the growth and development of a democratic culture."
    },
    {
        "name": "Economics",
        "number": "0112",
        "sections": "1",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The course provides a basic introduction to modern economics, especially as it applies to people, the choices they make, what role they have in the American economy, and what role the U.S. economy plays in the world economy. The course has both an American and a global focus. Economics is the study of how people use limited resources to satisfy unlimited wants and is certainly not limited to markets and money. In the widest sense, all decisions are economic decisions because our resources, including time, are limited but our desires are not.",
        "longinfo": "The course provides a basic introduction to modern economics, especially as it applies to people, the choices they make, what role they have in the American economy, and what role the U.S. economy plays in the world economy. The course has both an American and a global focus. Economics is the study of how people use limited resources to satisfy unlimited wants and is certainly not limited to markets and money. In the widest sense, all decisions are economic decisions because our resources, including time, are limited but our desires are not.\nCentral to the course are these questions: How is the American economy organized? How do markets for goods and services work? How do labor and resource markets work? How does international trade work? How is the world economy organized? What should governments–the U.S. government and foreign governments–do to achieve low unemployment, stable prices and economic growth? How do banks and the U.S. and global financial markets work? How do securities markets work? How does the Federal Reserve System regulate the money supply, interest rates, and the economy? How are companies and industries organized? Why are some industries dominated by a few large companies? How much should government regulate business to prevent monopoly and ensure competition with antitrust laws? What can be done about environmental pollution and the overuse of resources? What can be done about increasing income inequality and poverty? How can the American economy remain competitive in an era of globalization? How is the U.S. labor market changing?\nThe course will also cover the fundamentals of securities investment and financial planning, including the common investment vehicles used by investors–such as stocks, bonds and mutual funds–as well as more exotic items such as options and futures. Students will learn how to put together a portfolio of securities and work together to follow its performance.\nThroughout the course, students will study the current condition of the American and global economy by following current economic news and developments in companies, markets, and new products. The Wall Street Journal, Investor’s Business Daily, Business Week, and other publications will be used.\nThis is a “hands-on,” “real-world” course designed to develop basic understanding of economics and finance. There is an economic way of thinking, and students will learn how to apply that to actual problems and situations. Economics is something you do, rather than simply a body of material to study."
    },
    {
        "name": "AP Economics",
        "number": "0114",
        "sections": "2",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "This is a college-level course in modern economics. The course is devoted to the analysis of economic situations and economic problems. Major topics include the nature of markets, the structure of the American economy, product, labor and resource markers, the organization of American industry, government regulation of business and antitrust laws, taxation, the monetary system, inflation, business cycles, and government policies to achieve full employment and encourage economic growth. Much attention will also be given to the global economy and international economics, international finance and trade, to the role of the United States in the world economy, and to issues of American productivity and competitiveness.",
        "longinfo": "This is a college-level course in modern economics. The course is devoted to the analysis of economic situations and economic problems. Major topics include the nature of markets, the structure of the American economy, product, labor and resource markers, the organization of American industry, government regulation of business and antitrust laws, taxation, the monetary system, inflation, business cycles, and government policies to achieve full employment and encourage economic growth. Much attention will also be given to the global economy and international economics, international finance and trade, to the role of the United States in the world economy, and to issues of American productivity and competitiveness.\nThe course has a strong public policy orientation, and current economic problems– including the problems of poverty, increasing income inequality, environmental pollution, and resource use (and overuse)–will be explored. World economic development and issues of globalization will also be discussed. Since most contemporary problems have economic roots, the course will provide students with the economic understanding to address these problems. Some attention will be paid to the recent recession and financial crisis, how these came about, what is being done by the Federal Reserve and the Treasury to address them, and the slow recovery from the recession, and how recent changes in the U.S. labor market have complicated matters.\nContrary to what many people believe, economics is not essentially about money or wealth or even markets. Rather, it is about the use of limited resources to satisfy unlimited wants. Economic thinking requires choices. That means that the tools of “economic” thinking can be applied to many situations in everyday life and to how people make decisions. (Should I do this or that? How much time should I spend on this or that? How can I make both you and me better off?) This wider view of economics, which applies “economic” principles to wider human behavior and social cooperation, will also be a focus of the course, and game theory will be one of the tools used.\nThis is an economic training course, a course that stresses economic reasoning and application. Economics is not simply a subject to study. It is something you do."
    },
    {
        "name": "Global Conflict and Global Security",
        "number": "0143",
        "sections": "1",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course covers global conflict from 1919 to the present. It considers the global crises leading up to and resulting from World War II by analyzing the political, economic, social and military clashes between the key countries that dominated these events – Russia, Germany, Britain, France, the United States, China and Japan. The course begins with the creation of the Soviet Union and ends with the current international situation and threats to global security – threats posed by international terrorism (ISIS and Al-Qaeda), Iran, and North Korea. Breaking news in foreign and security affairs will be considered as it occurs.",
        "longinfo": "This course covers global conflict from 1919 to the present. It considers the global crises leading up to and resulting from World War II by analyzing the political, economic, social and military clashes between the key countries that dominated these events – Russia, Germany, Britain, France, the United States, China and Japan. The course begins with the creation of the Soviet Union and ends with the current international situation and threats to global security – threats posed by international terrorism (ISIS and Al-Qaeda), Iran, and North Korea. Breaking news in foreign and security affairs will be considered as it occurs. The course will concentrate on these topics:\nThe Rise and Fall of the Soviet Union and the Russian Aftermath: The nature, development and ultimate collapse of the Soviet Union, as well as Russia since 1991 and its drift back to authoritarianism and expansionism under Putin.\nThe Rise and Fall of Nazi Germany: The rise and appeal of Hitler; the nature and fate of the Nazi state, its geopolitical aims and plans for expansion, and the Holocaust.\nWorld War II in Europe and Asia. The crisis of appeasement and the outbreak of World War II in Europe, the fall of France, the Battle of Britain, and the course of World War II in Europe. Japan’s attempt to conquer China and control Asia, and World War II in the Pacific.\nThe Cold War. The origins of the Cold War, the division of Europe, and the role of NATO. The Korean War. The strategic military balance between the United States and Soviet Union. The end of Soviet domination of Eastern Europe, and the reunification of Germany.\nThe History of Nuclear Weapons. The development of nuclear weapons from the Manhattan Project to the present, how nuclear weapons work, the use of atomic weapons to end World War II, and the problem of nuclear proliferation. The accelerating Iranian and North Korean nuclear and missile programs and the threat they represent.\nChina. The rise of China as a major power and the implications of that on the balance of power in Asia.\nIn addition to studying some of the most compelling history of the last 95 years, the course aims to understand why things happened the way they did and not some other way – and to examine the circumstances and options that countries and leaders faced (or thought they faced), what was at stake and why leaders chose the options they did. Students will prepare political and strategic option analyses at the key turning points (“pivot points”) as well as essay analyses of those turning points. The course will also introduce some basic game theory and use it as one tool of analysis. Extensive class discussion and video material are important elements of the course.\n"
    },
    {
        "name": "Classical World Civilizations",
        "number": "0146",
        "sections": "1",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course on Classical World Civilizations will focus on the some of the greatest ancient civilizations of the world. Topics will include the following:\r 1) Fifth Century Greece \r2) The Egyptian and Near Eastern Empires of the Hellenistic World 3) The Mauryan and Gupta Empires of India\r 4) The Roman Republic and the Empire through Nero\r 5) The Zhou, Qin, and Han dynasties of China",
        "longinfo": "This course on Classical World Civilizations will focus on the some of the greatest ancient civilizations of the world. Topics will include the following: 1) Fifth Century Greece 2) The Egyptian and Near Eastern Empires of the Hellenistic World 3) The Mauryan and Gupta Empires of India 4) The Roman Republic and the Empire through Nero 5) The Zhou, Qin, and Han dynasties of China\nThe course will, then, cover a number of important regions across the globe, and will highlight many of the unique features that account for the greatness of these civilizations. Indeed, within each major civilization we will explore the traditional aspects of historical study – the political, economic and diplomatic. However, there will also be an examination of social and cultural themes to give a more full and thorough examination of these civilizations. So while textbooks and other traditional historical readings will be used for this type of coverage, we’ll use primary sources, art, and literature as well."
    },
    {
        "name": "Topics in Political Philosophy",
        "number": "0147",
        "sections": "1",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "In his Republic, Plato begins his discussion of the ideal state by asking a question: what is justice? In one way or another, every political system must deal with that question; at heart, political philosophy ponders the definitions of right and wrong. In other words, political philosophy is a branch of moral philosophy, one with a specific focus. Fundamentally, political philosophy is concerned with the relationship between the individual and society; more narrowly, it is concerned with the relationship between the individual and the state, and with the design of that state. ",
        "longinfo": "In his Republic, Plato begins his discussion of the ideal state by asking a question: what is justice? In one way or another, every political system must deal with that question; at heart, political philosophy ponders the definitions of right and wrong. In other words, political philosophy is a branch of moral philosophy, one with a specific focus. Fundamentally, political philosophy is concerned with the relationship between the individual and society; more narrowly, it is concerned with the relationship between the individual and the state, and with the design of that state. This course will deal with the basic questions of political philosophy as they have been asked throughout Western history. What is the nature of justice? What are the rights of the individual, and on what are they founded? What are the responsibilities of the individual? Is there such a thing as natural law and natural morality? What are the responsibilities of the government? What is the legitimate source of political authority? How are goods distributed in a just society? When, if ever, should the common good take precedence over individual liberty? The course will follow the historical dialogue, from the time of Plato to the present day; the aim of the course is to teach students how to think philosophically about political issues. Students will read the work of thinkers such as Plato, Aristotle, More, Hobbes, Rousseau, Locke, Freud, Marx, Thoreau, and Wollstonecraft."
    },
    {
        "name": "Comparative Race and Ethnicity",
        "number": "0151",
        "sections": "2",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Our approach to the topic begins with the examination of some basic concepts, such as ethnicity and race, racism and ethnocentrism, racial and ethnic stratification, prejudice and discrimination, and the theoretical models of race relations–i.e., assimilation and pluralism. From these introductory sessions, the course will move to specific group studies. We will examine the role of ethnicity and race in shaping collective and personal identities in the United States. We will then consider patterns of race and ethnic relations in other heterogeneous societies while adopting a comparative perspective–vis-à-vis the American (U.S.) case. Our global approach will emphasize the prevalence of intergroup conflict in the modern world. A major component will also be examining current events as they relate to our study. If taught this year, for example, topics would have included the crises in Ferguson, MO; New York City, NY; Paris, France; and eastern Ukraine.\r",
        "longinfo": "Our approach to the topic begins with the examination of some basic concepts, such as ethnicity and race, racism and ethnocentrism, racial and ethnic stratification, prejudice and discrimination, and the theoretical models of race relations–i.e., assimilation and pluralism. From these introductory sessions, the course will move to specific group studies. We will examine the role of ethnicity and race in shaping collective and personal identities in the United States. We will then consider patterns of race and ethnic relations in other heterogeneous societies while adopting a comparative perspective–vis-à-vis the American (U.S.) case. Our global approach will emphasize the prevalence of intergroup conflict in the modern world. A major component will also be examining current events as they relate to our study. If taught this year, for example, topics would have included the crises in Ferguson, MO; New York City, NY; Paris, France; and eastern Ukraine.\r"
    },
    {
        "name": "Islamic World History",
        "number": "0155",
        "sections": "1",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "For nearly the entire life of a Horace Mann student, the United States has been at war in the Islamic world. And yet, outside of violent images of revolution and fundamentalists that we see in the media, many of us know very little about the people and culture of a region that we are so intertwined with. This course seeks to explore the history of the Middle East and Islamic World so that we may better understand the complexities of one of the world’s most important civilizations.",
        "longinfo": "For nearly the entire life of a Horace Mann student, the United States has been at war in the Islamic world. And yet, outside of violent images of revolution and fundamentalists that we see in the media, many of us know very little about the people and culture of a region that we are so intertwined with. This course seeks to explore the history of the Middle East and Islamic World so that we may better understand the complexities of one of the world’s most important civilizations.\nThe culture and religion of Islam have acted as a unifying force across large sections of Africa, Asia, and Europe, creating essentially a single world-system that included West Africa, the Middle East, and India, as well as parts of Europe and China. The shared religion of Islam, which often carried with it a shared priority on literacy and education, created the basis for a level of cultural exchange and technological development unprecedented in world history. This class will examine the Islamic world system in three distinct periods in its history: the rise of Islam and the development of Islamic Empires; the eighteenth and nineteenth centuries, when empires such as the Ottomans faced external political and intellectual challenges from a rising Europe as well as from internal reform movements; and finally the rise of nation- states after World War I. The spread of Islam brought new ideas in art and architecture, revived and expanded on Greek philosophy, and introduced an unprecedented level of religious tolerance to the medieval world. The latter two sections will also lead us to examine topics that students have been exposed to before–the Enlightenment, absolutism and constitutionalism, gender relations, colonialism, nationalism, and socialism–but we will study them in a new context. We will also explore new topics such as economics and world trade (the Suez Canal and oil), Cold War alliances, and Islamic politics and fundamentalism.\n"
    },
    {
        "name": "Decolonization and Postcolonialism",
        "number": "0157",
        "sections": "1",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course covers revolution and its aftermath in South Asia, Southeast Asia, and Africa. This elective takes an in-depth look at national independence movements in these regions after World War II. In some cases the movements spawned thriving countries and in other cases they led to conflict and poverty. The course will seek to examine the cultural (e.g., ethnic, racial, and religious diversity), social (e.g., economic development), and political (e.g., the development of democracy) influences that led to each country’s modern situation. Students will collectively engage theoretical approaches to imperialism and colonialism, the psychology of colonialism, and patterns of decolonization and development while broadening their global perspectives and challenging engrained stereotypes and preconceptions.",
        "longinfo": "This course covers revolution and its aftermath in South Asia, Southeast Asia, and Africa. This elective takes an in-depth look at national independence movements in these regions after World War II. In some cases the movements spawned thriving countries and in other cases they led to conflict and poverty. The course will seek to examine the cultural (e.g., ethnic, racial, and religious diversity), social (e.g., economic development), and political (e.g., the development of democracy) influences that led to each country’s modern situation. Students will collectively engage theoretical approaches to imperialism and colonialism, the psychology of colonialism, and patterns of decolonization and development while broadening their global perspectives and challenging engrained stereotypes and preconceptions.\nIn each trimester we'll work with theories of imperialism and colonialism as we explore the modern historical development of each of our regions. This development follows a similar pattern in each region: the exploitation and oppression of the colonial era, the creation and growth of a national independence movement, the challenges, struggles, and achievements of postcolonial development. In the first trimester we'll be looking at colonization, independence, and development in the first two nations to gain independence after World War II: India and Pakistan. In trimester two we'll shift our focus to Southeast Asia as we investigate the pattern of development in Vietnam, Indonesia, Thailand, Cambodia, Malaysia, Burma, and the Philippines. And, finally, in trimester three we'll turn to Africa, taking on the independence and postcolonial development of nations such as Nigeria, Kenya, Ghana, Sudan, Rwanda, and South Africa. Students will play a very active role in this seminar-style class. In each trimester there will be opportunities to develop research and presentation skills, in addition to honing skills in critical reading and analytical writing. We'll engage with primary and secondary sources, use images, video, and other multi-media resources, and keep an eye at all times on contemporary events unfolding in the postcolonial settings we're studying. We seek to examine the past for its own sake, but we also aim for a deeper and more expansive understanding of today's world."
    },
    {
        "name": "Contemporary U.S. History",
        "number": "0160",
        "sections": "2",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "At the start of a new century, the United States finds itself in the enviable position of a dominant political, economic, cultural, and military power. But the U.S. had to undergo some profound changes to get to this point. This course will examine the development of the U.S. from 1960 to the present and try to shed some lights on key issues of the recent past by focusing on four major areas: (1) law and politics, (2) popular culture, (3) foreign policy, (4) social and economic changes from post-industrialization. We will use a variety of texts including films, original documents, scholarly articles, and music.",
        "longinfo": "At the start of a new century, the United States finds itself in the enviable position of a dominant political, economic, cultural, and military power. But the U.S. had to undergo some profound changes to get to this point. This course will examine the development of the U.S. from 1960 to the present and try to shed some lights on key issues of the recent past by focusing on four major areas: (1) law and politics, (2) popular culture, (3) foreign policy, (4) social and economic changes from post-industrialization. We will use a variety of texts including films, original documents, scholarly articles, and music. Specific topics include:\nFall Trimester – 1960’s: liberalism under JFK, the Great Society, and the Warren Court; Containment and Vietnam; Television and Rock N’ Roll and the cultural mainstream; Civil Rights and Black Power; the Counterculture and the end of Modernism; the New Left, 1968, and the rise of the Silent Majority.\nWinter Trimester – 1970’s and 1980’s: Nixon and Watergate; Social Movements of the 70’s – feminism, gay rights, fundamentalism, and the environment; New York City’s budget crisis and the blackout; Postmodernism and Malaise; the Reagan Revolution.\nSpring trimester - 1980’s to the present: Culture and Society in 1980’s; the end of the Cold War; the rise of Bill Clinton; the rise of technology and changes in popular culture; Prosperity and Division in the 1990’s; the Clinton wars at home and abroad; 9/11; Bush and resurgent conservatism; prospects for the Obama presidency."
    },
    {
        "name": "Voices of Protest",
        "number": "0161",
        "sections": "1",
        "department": 1,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Throughout American history, protest movements have challenged Americans to live up to their professed ideals. Voices of Protest studies the last century through those protest movements, analyzing how citizens have attacked the status quo and formulated new alternatives. The class will consider the ways dissent is articulated and its complex influence on society - from the Suffragists through today's Tea Party. The course is organized around six broad protest movements of the 20th century. We will analyze and engage with the history of various protest movements – as well as the responses to them – through a variety of sources, some rarely considered in history classes: portions of novels, short stories, even plays and poetry. Using different forms of literature to probe history incorporates an interdisciplinary approach to the class; however, more traditional primary and secondary sources (essays, articles, manifestos, speeches, and images) will be a key component of the assigned readings and discussions. \r",
        "longinfo": "Throughout American history, protest movements have challenged Americans to live up to their professed ideals. Voices of Protest studies the last century through those protest movements, analyzing how citizens have attacked the status quo and formulated new alternatives. The class will consider the ways dissent is articulated and its complex influence on society - from the Suffragists through today's Tea Party. The course is organized around six broad protest movements of the 20th century. We will analyze and engage with the history of various protest movements – as well as the responses to them – through a variety of sources, some rarely considered in history classes: portions of novels, short stories, even plays and poetry. Using different forms of literature to probe history incorporates an interdisciplinary approach to the class; however, more traditional primary and secondary sources (essays, articles, manifestos, speeches, and images) will be a key component of the assigned readings and discussions. \nStudents will write responses to readings, as well as complete research projects in areas of personal interest. We will move through the material thematically and chronologically, and address the following six units:\n(1) Capitalism's Discontents: from Industrialization to Occupy Wall Street (2) Civil Rights: from the New Negro to Black Power\n(3) War Protests: from World War I to Afghanistan\n(4) Women's Rights: from Suffragism to Modern Feminism\n(5) Gay Rights: from Stonewall to Marriage Equality\n(6) Environmentalism: from the Disappearing West to Ecoterrorism"
    },
    {
        "name": "French 2",
        "number": "0203",
        "sections": "2",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Although the fundamentals of French grammar are presented formally throughout the year, the emphasis in this course is on the development of fluency in French and on a more detailed study of reading and writing based on literary texts. Appropriate cultural topics are introduced through art and audio-visual materials. The use of French as a vehicle of daily communication is stressed. Active oral participation is of primary importance and is reinforced throughout the year.",
        "longinfo": "Although the fundamentals of French grammar are presented formally throughout the year, the emphasis in this course is on the development of fluency in French and on a more detailed study of reading and writing based on literary texts. Appropriate cultural topics are introduced through art and audio-visual materials. The use of French as a vehicle of daily communication is stressed. Active oral participation is of primary importance and is reinforced throughout the year."
    },
    {
        "name": "French 2H",
        "number": "0204",
        "sections": "2",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "This course parallels the French II course described above, but with much more extensive literary readings and more in depth study of grammar. Written assignments are given frequently and the course is taught almost entirely in French.",
        "longinfo": "This course parallels the French II course described above, but with much more extensive literary readings and more in depth study of grammar. Written assignments are given frequently and the course is taught almost entirely in French."
    },
    {
        "name": "French 3",
        "number": "0205",
        "sections": "2",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course continues the work of French II. More extensive grammar study, idiomatic expressions, practical vocabulary, readings, geography and culture are the basis of the course. Conversational skills are emphasized throughout the year with continuation of grammar, listening, reading and writing skills",
        "longinfo": "This course continues the work of French II. More extensive grammar study, idiomatic expressions, practical vocabulary, readings, geography and culture are the basis of the course. Conversational skills are emphasized throughout the year with continuation of grammar, listening, reading and writing skills"
    },
    {
        "name": "French 3H",
        "number": "0206",
        "sections": "2",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "Taught entirely in French, this course is designed for students with excellent background in the language. The class revolves around the four basic skills of listening, speaking, reading and writing French. French literature, including poetry and plays, is introduced and studied as a source of language and culture. Grammar is reinforced and vocabulary expanded through readings and constant conversation in French.",
        "longinfo": "Taught entirely in French, this course is designed for students with excellent background in the language. The class revolves around the four basic skills of listening, speaking, reading and writing French. French literature, including poetry and plays, is introduced and studied as a source of language and culture. Grammar is reinforced and vocabulary expanded through readings and constant conversation in French."
    },
    {
        "name": "French 4",
        "number": "0207",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course, taught primarily in French, focuses on the study of the cultures and literatures of the Francophonie along with grammar review in order to support communication. Students read, discuss, investigate, write and make presentations on various aspects of the French-speaking world. Materials are eclectic, and include literature, visual art, music and film.",
        "longinfo": "This course, taught primarily in French, focuses on the study of the cultures and literatures of the Francophonie along with grammar review in order to support communication. Students read, discuss, investigate, write and make presentations on various aspects of the French-speaking world. Materials are eclectic, and include literature, visual art, music and film."
    },
    {
        "name": "French 4H",
        "number": "0208",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "Conducted entirely in French, this course continues the work of French III honors with intensive practice of all four skills: listening, speaking, reading and writing. Through literary readings, current events, audio- visual exercises and grammar review, this course of study prepares students who wish to continue their studies in the AP French Language and Culture course.",
        "longinfo": "Conducted entirely in French, this course continues the work of French III honors with intensive practice of all four skills: listening, speaking, reading and writing. Through literary readings, current events, audio- visual exercises and grammar review, this course of study prepares students who wish to continue their studies in the AP French Language and Culture course."
    },
    {
        "name": "French 5",
        "number": "0209",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This year long investigation into various aspects of the language, history, civilization and culture of France and the Francophonie offers students the opportunity to continue improving their language skills while they deepen their understanding of the diversity of the French-speaking world. French films and related readings serve as a springboard for discussion and writing. The course, taught entirely in French, asks students to read, discuss, debate, make oral presentations, and write compositions on a myriad of topics. Grammar is reviewed as necessary in order to support the clear communication of ideas.",
        "longinfo": "This year long investigation into various aspects of the language, history, civilization and culture of France and the Francophonie offers students the opportunity to continue improving their language skills while they deepen their understanding of the diversity of the French-speaking world. French films and related readings serve as a springboard for discussion and writing. The course, taught entirely in French, asks students to read, discuss, debate, make oral presentations, and write compositions on a myriad of topics. Grammar is reviewed as necessary in order to support the clear communication of ideas."
    },
    {
        "name": "French 5H",
        "number": "0210",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "This year long investigation into various aspects of the language, history, civilization and culture of France and the Francophonie offers students the opportunity to continue improving their language skills while they deepen their understanding of the diversity of the French-speaking world. French films and related readings serve as a springboard for discussion and writing. The course, taught entirely in French, asks students to read, discuss, debate, make oral presentations, and write compositions on a myriad of topics. Grammar is reviewed as necessary in order to support the clear communication of ideas.",
        "longinfo": "This year long investigation into various aspects of the language, history, civilization and culture of France and the Francophonie offers students the opportunity to continue improving their language skills while they deepen their understanding of the diversity of the French-speaking world. French films and related readings serve as a springboard for discussion and writing. The course, taught entirely in French, asks students to read, discuss, debate, make oral presentations, and write compositions on a myriad of topics. Grammar is reviewed as necessary in order to support the clear communication of ideas."
    },
    {
        "name": "AP French Language and Culture",
        "number": "0213",
        "sections": "2",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "Conducted entirely in French, this course prepares students for the Advanced Placement examination in French language and culture. The course is designed to promote fluency. Spoken French is emphasized through various audio sources, language laboratory sessions, films and video clips. Grammar is reviewed thoroughly and frequent reading and writing assignments promote student proficiency in these areas. Readings include representative works by major French speaking authors from the Renaissance to the present. The class also views videotaped versions of the readings, which are then discussed. Students are asked to write critical and analytical essays about literature and other cultural topics.",
        "longinfo": "Conducted entirely in French, this course prepares students for the Advanced Placement examination in French language and culture. The course is designed to promote fluency. Spoken French is emphasized through various audio sources, language laboratory sessions, films and video clips. Grammar is reviewed thoroughly and frequent reading and writing assignments promote student proficiency in these areas. Readings include representative works by major French speaking authors from the Renaissance to the present. The class also views videotaped versions of the readings, which are then discussed. Students are asked to write critical and analytical essays about literature and other cultural topics."
    },
    {
        "name": "French Seminar",
        "number": "0216",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Conducted entirely in French, this course is designed for students who have had significant previous study and who are able to function independently in a French environment. Students at this level demonstrate a high level of proficiency in speaking and writing. The students will attain a broader appreciation of French culture and literature through film, articles, short literary works, and other audio-visual components. The class takes a discussion style format as students debate, inquire and make connections to better understand the French culture. The course is divided into three units by trimester including topics such as: Gastronomy and French cuisine; Education; Introduction to the Francophone world; Immigration; French cinema; French philosophers; Introduction to French literature and theater. Assessment for this class is based on formal and informal expression, both written and spoken, and consists primarily of class projects, essays and oral participation in class.",
        "longinfo": "Conducted entirely in French, this course is designed for students who have had significant previous study and who are able to function independently in a French environment. Students at this level demonstrate a high level of proficiency in speaking and writing. The students will attain a broader appreciation of French culture and literature through film, articles, short literary works, and other audio-visual components. The class takes a discussion style format as students debate, inquire and make connections to better understand the French culture. The course is divided into three units by trimester including topics such as: Gastronomy and French cuisine; Education; Introduction to the Francophone world; Immigration; French cinema; French philosophers; Introduction to French literature and theater. Assessment for this class is based on formal and informal expression, both written and spoken, and consists primarily of class projects, essays and oral participation in class."
    },
    {
        "name": "German 1",
        "number": "0230",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course is not offered this year.",
        "longinfo": "This course is not offered this year."
    },
    {
        "name": "German 2",
        "number": "0232",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course is not offered this year.",
        "longinfo": "This course is not offered this year."
    },
    {
        "name": "Japanese 1",
        "number": "0260",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course introduces students to modern Japanese, building the foundations for understanding, speaking reading and writing the language. The spoken language is emphasized through grammar and vocabulary lessons, interactive dialogues, reading of short texts, and writing short journals in Japanese. Since language and culture go hand-in-hand, elements of Japanese culture are introduced. Students are offered opportunities to experience Japanese cuisine, games, songs and calligraphy. The students also participate in Japan Day and an off-campus trip to a Japanese tea ceremony.",
        "longinfo": "This course introduces students to modern Japanese, building the foundations for understanding, speaking reading and writing the language. The spoken language is emphasized through grammar and vocabulary lessons, interactive dialogues, reading of short texts, and writing short journals in Japanese. Since language and culture go hand-in-hand, elements of Japanese culture are introduced. Students are offered opportunities to experience Japanese cuisine, games, songs and calligraphy. The students also participate in Japan Day and an off-campus trip to a Japanese tea ceremony."
    },
    {
        "name": "Japanese 2",
        "number": "0261",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "In this course, students build on the skills acquired in Japanese I with a continued focus on the spoken language, basic grammatical forms and Kanji writing. Students do more frequent journal writing and complete two major projects. In these projects, students participate in a Japanese play and study cultural topics. Students participate in Japan Day as well as a variety of other cultural and experiential learning activities.",
        "longinfo": "In this course, students build on the skills acquired in Japanese I with a continued focus on the spoken language, basic grammatical forms and Kanji writing. Students do more frequent journal writing and complete two major projects. In these projects, students participate in a Japanese play and study cultural topics. Students participate in Japan Day as well as a variety of other cultural and experiential learning activities."
    },
    {
        "name": "Japanese 3",
        "number": "0263",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "In this course, students continue building their competence in written and spoken Japanese and mastering a number of complex grammatical forms. Reading comprehension of literary passages, essay and haiku writings, and some Japanese films are used to expose students to the language in authentic and natural contexts. This course emphasizes practical communication skills and the rudiments of the formal language, both written and spoken. The students participate in Japan Day and complete projects on cultural topics.",
        "longinfo": "In this course, students continue building their competence in written and spoken Japanese and mastering a number of complex grammatical forms. Reading comprehension of literary passages, essay and haiku writings, and some Japanese films are used to expose students to the language in authentic and natural contexts. This course emphasizes practical communication skills and the rudiments of the formal language, both written and spoken. The students participate in Japan Day and complete projects on cultural topics."
    },
    {
        "name": "Japanese 3H",
        "number": "0264",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "In this course, students continue building their competence in written and spoken Japanese and mastering a number of complex grammatical forms. Reading comprehension of literary passages, essay and haiku writings, and some Japanese films are used to expose students to the language in authentic and natural contexts. This course emphasizes practical communication skills and the rudiments of the formal language, both written and spoken. The students participate in Japan Day and complete projects on cultural topics.",
        "longinfo": "In this course, students continue building their competence in written and spoken Japanese and mastering a number of complex grammatical forms. Reading comprehension of literary passages, essay and haiku writings, and some Japanese films are used to expose students to the language in authentic and natural contexts. This course emphasizes practical communication skills and the rudiments of the formal language, both written and spoken. The students participate in Japan Day and complete projects on cultural topics."
    },
    {
        "name": "Japanese 5",
        "number": "0267",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course is designed for students with a solid Japanese language background. It is also designed for the students who have completed AP Japanese. Students learn to use honorifics, humble and polite language, increase their study of Chinese characters (Kanji), and read literary texts in Japanese. They are encouraged to participate in speech contests and other events, and to use Japanese word processors for writing essays and email. The class is conducted completely in Japanese.",
        "longinfo": "This course is designed for students with a solid Japanese language background. It is also designed for the students who have completed AP Japanese. Students learn to use honorifics, humble and polite language, increase their study of Chinese characters (Kanji), and read literary texts in Japanese. They are encouraged to participate in speech contests and other events, and to use Japanese word processors for writing essays and email. The class is conducted completely in Japanese."
    },
    {
        "name": "Japanese 5H",
        "number": "0268",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "This course is designed for students with a solid Japanese language background. It is also designed for the students who have completed AP Japanese. Students learn to use honorifics, humble and polite language, increase their study of Chinese characters (Kanji), and read literary texts in Japanese. They are encouraged to participate in speech contests and other events, and to use Japanese word processors for writing essays and email. The class is conducted completely in Japanese.",
        "longinfo": "This course is designed for students with a solid Japanese language background. It is also designed for the students who have completed AP Japanese. Students learn to use honorifics, humble and polite language, increase their study of Chinese characters (Kanji), and read literary texts in Japanese. They are encouraged to participate in speech contests and other events, and to use Japanese word processors for writing essays and email. The class is conducted completely in Japanese."
    },
    {
        "name": "Japanese 6H",
        "number": "0270",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "A continuation of Japanese V and V honors, these courses are for students with advanced skills who have completed all previous course offerings in Japanese. Students are encouraged to complete independent projects that reflect their interests and abilities. The class is conducted completely in Japanese.",
        "longinfo": "A continuation of Japanese V and V honors, these courses are for students with advanced skills who have completed all previous course offerings in Japanese. Students are encouraged to complete independent projects that reflect their interests and abilities. The class is conducted completely in Japanese."
    },
    {
        "name": "AP Japanese Language and Culture",
        "number": "0271",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "Conducted entirely in Japanese, this course is designed to prepare the students for the Advanced Placement examination in Japanese Language and Culture. This course aims to foster oral and written proficiency in language and culture. Students will develop the productive, receptive and cultural skills necessary to communicate with native speakers of Japanese. Oral Japanese is stressed and perfected through class discussions, auditory practice, language laboratory sessions, films and frequent reading and writing assignments. Students write expository essays in Japanese and analyze some literary works. Grammar and Kanji are reviewed thoroughly.",
        "longinfo": "Conducted entirely in Japanese, this course is designed to prepare the students for the Advanced Placement examination in Japanese Language and Culture. This course aims to foster oral and written proficiency in language and culture. Students will develop the productive, receptive and cultural skills necessary to communicate with native speakers of Japanese. Oral Japanese is stressed and perfected through class discussions, auditory practice, language laboratory sessions, films and frequent reading and writing assignments. Students write expository essays in Japanese and analyze some literary works. Grammar and Kanji are reviewed thoroughly."
    },
    {
        "name": "Chinese 1",
        "number": "0285",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course for beginners meets five days per week and emphasizes the fundamental elements of spoken and written Mandarin Chinese. Functional language is emphasized as language skill acquisition goes hand- in-hand with cultural exposure. The tone system, phonetic transcription, word order, grammar, and the basics of writing Chinese characters are important features of this class. Both simplified characters and traditional characters are used.",
        "longinfo": "This course for beginners meets five days per week and emphasizes the fundamental elements of spoken and written Mandarin Chinese. Functional language is emphasized as language skill acquisition goes hand- in-hand with cultural exposure. The tone system, phonetic transcription, word order, grammar, and the basics of writing Chinese characters are important features of this class. Both simplified characters and traditional characters are used."
    },
    {
        "name": "Chinese 2",
        "number": "0287",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The second-level Mandarin Chinese language course will build on the basic skills acquired in Chinese I. There is an emphasis on colloquial usage, self-expression (both in speech and in writing), and Chinese culture, such as Chinese Lunar New Year and the Mid-Autumn Festival. Both simplified characters and traditional characters are used.",
        "longinfo": "The second-level Mandarin Chinese language course will build on the basic skills acquired in Chinese I. There is an emphasis on colloquial usage, self-expression (both in speech and in writing), and Chinese culture, such as Chinese Lunar New Year and the Mid-Autumn Festival. Both simplified characters and traditional characters are used."
    },
    {
        "name": "Chinese 3",
        "number": "0289",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The third-level Mandarin Chinese language course is a continuation of Chinese II. The course continues to build upon the four skills of listening, reading, speaking and writing with increased focus on short compositions. Both simplified characters and traditional characters are used, and cultural topics are emphasized.",
        "longinfo": "The third-level Mandarin Chinese language course is a continuation of Chinese II. The course continues to build upon the four skills of listening, reading, speaking and writing with increased focus on short compositions. Both simplified characters and traditional characters are used, and cultural topics are emphasized."
    },
    {
        "name": "Chinese 4",
        "number": "0291",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The fourth-level Mandarin Chinese language course includes a review of basic and intermediate structures within a culture related context. The four language skills of listening, speaking, reading and writing are developed within a variety of classroom activities. Instruction progresses to more extensive practice with advanced grammatical elements, idiomatic expressions, and practical vocabulary. Students are asked to incorporate grammar and vocabulary elements to compose short compositions on designated topics and give multiple oral presentations. This course is conducted primarily in Chinese.",
        "longinfo": "The fourth-level Mandarin Chinese language course includes a review of basic and intermediate structures within a culture related context. The four language skills of listening, speaking, reading and writing are developed within a variety of classroom activities. Instruction progresses to more extensive practice with advanced grammatical elements, idiomatic expressions, and practical vocabulary. Students are asked to incorporate grammar and vocabulary elements to compose short compositions on designated topics and give multiple oral presentations. This course is conducted primarily in Chinese."
    },
    {
        "name": "Chinese 5",
        "number": "0295",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course is designed to further develop proficiency in speaking and writing through readings and discussion of socio-cultural topics relevant to modern China. Students learn to further improve oral communicative competence by incorporating formal usages. Students also acquire vocabulary and grammar patterns necessary for conducting discussions inspired by selected Chinese films, as well as literary readings (traditional poetry, essays, short stories). Student progress is assessed through self-created dialogs, essays, presentations, comprehension quizzes and comprehensive tests. This class is conducted completely in Chinese.",
        "longinfo": "This course is designed to further develop proficiency in speaking and writing through readings and discussion of socio-cultural topics relevant to modern China. Students learn to further improve oral communicative competence by incorporating formal usages. Students also acquire vocabulary and grammar patterns necessary for conducting discussions inspired by selected Chinese films, as well as literary readings (traditional poetry, essays, short stories). Student progress is assessed through self-created dialogs, essays, presentations, comprehension quizzes and comprehensive tests. This class is conducted completely in Chinese."
    },
    {
        "name": "Latin 1",
        "number": "0301",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Latin I is designed for students new to the study of Latin. In this course students are introduced to core concepts of Latin grammar and develop basic reading vocabulary. The primary course focus rests on mastery of declensions, conjugations, and the grammatical structures of the Latin sentence. Students will acquire the skills to read stories adapted from the famous legends of Roman mythology and history. Through the eyes of the great storytellers of Rome students will become acquainted with the classical world, the Roman way of life, and Roman culture. In addition, they will learn to understand Latin as one of the foundational languages of European culture.",
        "longinfo": "Latin I is designed for students new to the study of Latin. In this course students are introduced to core concepts of Latin grammar and develop basic reading vocabulary. The primary course focus rests on mastery of declensions, conjugations, and the grammatical structures of the Latin sentence. Students will acquire the skills to read stories adapted from the famous legends of Roman mythology and history. Through the eyes of the great storytellers of Rome students will become acquainted with the classical world, the Roman way of life, and Roman culture. In addition, they will learn to understand Latin as one of the foundational languages of European culture."
    },
    {
        "name": "Latin 2",
        "number": "0303",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Students continue their study of Latin by furthering their acquisition of basic grammar, vocabulary and forms. The course includes a review of Latin I and the completion of rudiments of grammar. Students learn much new vocabulary while continuing to work with historical readings. For the first time, students read selections of Latin prose literature in the original, mostly from the works of Caesar.",
        "longinfo": "Students continue their study of Latin by furthering their acquisition of basic grammar, vocabulary and forms. The course includes a review of Latin I and the completion of rudiments of grammar. Students learn much new vocabulary while continuing to work with historical readings. For the first time, students read selections of Latin prose literature in the original, mostly from the works of Caesar."
    },
    {
        "name": "Latin B",
        "number": "0304",
        "sections": "1",
        "department": 2,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Latin B is designed for students with one year of prior Latin instruction. In Latin B students continue the study of Latin, strengthening their grasp of Latin grammar and expanding their vocabulary. As they learn to read the language of Caesar, Vergil, and Ovid, among others, they will solidify their reading skills and broaden their capacity for analysis and interpretation. In addition, the course will focus on the traces Latin has left in the English language. It will provide a nuanced understanding of the stories Romans loved to hear, about their gods, their heroes, and their ancestors. Upon successful completion of this course students may continue with either Latin C or Latin II.",
        "longinfo": "Latin B is designed for students with one year of prior Latin instruction. In Latin B students continue the study of Latin, strengthening their grasp of Latin grammar and expanding their vocabulary. As they learn to read the language of Caesar, Vergil, and Ovid, among others, they will solidify their reading skills and broaden their capacity for analysis and interpretation. In addition, the course will focus on the traces Latin has left in the English language. It will provide a nuanced understanding of the stories Romans loved to hear, about their gods, their heroes, and their ancestors. Upon successful completion of this course students may continue with either Latin C or Latin II."
    },
    {
        "name": "Latin 3",
        "number": "0305",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The objectives of this course are to read, understand, and interpret Latin prose literature in the original. Authors include Cicero, Sallust, and Pliny the Younger as well as some poetry may be read. Students explore the stylistic differences and literary richness of classical authors as well as a more specific theme: the political scene in the late republic and the early empire.",
        "longinfo": "The objectives of this course are to read, understand, and interpret Latin prose literature in the original. Authors include Cicero, Sallust, and Pliny the Younger as well as some poetry may be read. Students explore the stylistic differences and literary richness of classical authors as well as a more specific theme: the political scene in the late republic and the early empire."
    },
    {
        "name": "Latin C",
        "number": "0306",
        "sections": "1",
        "department": 2,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course is the sequel to Latin B. Emphasis will continue to be placed on the acquisition of vocabulary and more complex grammatical constructions through readings, which explore the history, culture, mythology, and geography of the Roman world. Increased attention will be placed on accurately developing sight reading abilities of Latin prose. Upon successful completion of this course, students may continue with Latin D or Latin III.",
        "longinfo": "This course is the sequel to Latin B. Emphasis will continue to be placed on the acquisition of vocabulary and more complex grammatical constructions through readings, which explore the history, culture, mythology, and geography of the Roman world. Increased attention will be placed on accurately developing sight reading abilities of Latin prose. Upon successful completion of this course, students may continue with Latin D or Latin III."
    },
    {
        "name": "Latin 3H",
        "number": "0307",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "The objectives of this course are to read, understand, and interpret Latin prose literature in the original. Authors include Cicero, Sallust, and Pliny the Younger as well as some poetry may be read. Students explore the stylistic differences and literary richness of classical authors as well as a more specific theme: the political scene in the late republic and the early empire.",
        "longinfo": "The objectives of this course are to read, understand, and interpret Latin prose literature in the original. Authors include Cicero, Sallust, and Pliny the Younger as well as some poetry may be read. Students explore the stylistic differences and literary richness of classical authors as well as a more specific theme: the political scene in the late republic and the early empire."
    },
    {
        "name": "Latin D",
        "number": "0310",
        "sections": "1",
        "department": 2,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course is the sequel to Latin C and completes the study of advanced Latin grammar and syntax through primary sources. The objective of this course is to gain increased proficiency in reading authentic Latin by studying selected works of Cicero and Pliny the Younger. In addition to the emphasis placed on producing literal and accurate translations, students will continue to develop familiarity with Latin style while devoting attention to literary and historical analysis. By studying these authors we will also explore the political, social, and cultural background of the late Republic and early Empire, which is the context for these works.",
        "longinfo": "This course is the sequel to Latin C and completes the study of advanced Latin grammar and syntax through primary sources. The objective of this course is to gain increased proficiency in reading authentic Latin by studying selected works of Cicero and Pliny the Younger. In addition to the emphasis placed on producing literal and accurate translations, students will continue to develop familiarity with Latin style while devoting attention to literary and historical analysis. By studying these authors we will also explore the political, social, and cultural background of the late Republic and early Empire, which is the context for these works."
    },
    {
        "name": "Latin 5",
        "number": "0312",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The objectives of this class are to explore the influential writings of major Roman authors from the Golden and Silver Ages of Latin literature, thus allowing students to continue their study beyond the AP level. Reading selections will draw from both prose and poetry and may include the following authors: Catullus, Horace, Ovid, Martial, Livy, and epigraphic sources. In addition to developing a greater understanding of the nuances of the language, significant attention will be paid to the historical period of the authors, the historical references within the works, syntactical constructions, and poetic styles.",
        "longinfo": "The objectives of this class are to explore the influential writings of major Roman authors from the Golden and Silver Ages of Latin literature, thus allowing students to continue their study beyond the AP level. Reading selections will draw from both prose and poetry and may include the following authors: Catullus, Horace, Ovid, Martial, Livy, and epigraphic sources. In addition to developing a greater understanding of the nuances of the language, significant attention will be paid to the historical period of the authors, the historical references within the works, syntactical constructions, and poetic styles."
    },
    {
        "name": "Latin 5H",
        "number": "0313",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "The objectives of this class are to explore the influential writings of major Roman authors from the Golden and Silver Ages of Latin literature, thus allowing students to continue their study beyond the AP level. Reading selections will draw from both prose and poetry and may include the following authors: Catullus, Horace, Ovid, Martial, Livy, and epigraphic sources. In addition to developing a greater understanding of the nuances of the language, significant attention will be paid to the historical period of the authors, the historical references within the works, syntactical constructions, and poetic styles.",
        "longinfo": "The objectives of this class are to explore the influential writings of major Roman authors from the Golden and Silver Ages of Latin literature, thus allowing students to continue their study beyond the AP level. Reading selections will draw from both prose and poetry and may include the following authors: Catullus, Horace, Ovid, Martial, Livy, and epigraphic sources. In addition to developing a greater understanding of the nuances of the language, significant attention will be paid to the historical period of the authors, the historical references within the works, syntactical constructions, and poetic styles."
    },
    {
        "name": "AP Latin",
        "number": "0317",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "In this course, students read considerable selections of Vergil's Aeneid (epic poetry) and Caesar's Bellum Gallicum (prose) in Latin. A thorough knowledge of the plot of the remaining portions of each work will be read in English so that significant themes, central characters, and key ideas may be fully explored. This course emphasizes an appreciation of both works as important examples of their respective genres, with special attention paid to literary style, critical interpretation, and the workings of hexameter verse. The political, historical, and cultural environment that gave rise to the figures of Caesar and Augustus will be explored in detail.",
        "longinfo": "In this course, students read considerable selections of Vergil's Aeneid (epic poetry) and Caesar's Bellum Gallicum (prose) in Latin. A thorough knowledge of the plot of the remaining portions of each work will be read in English so that significant themes, central characters, and key ideas may be fully explored. This course emphasizes an appreciation of both works as important examples of their respective genres, with special attention paid to literary style, critical interpretation, and the workings of hexameter verse. The political, historical, and cultural environment that gave rise to the figures of Caesar and Augustus will be explored in detail."
    },
    {
        "name": "Latin E",
        "number": "0318",
        "sections": "1",
        "department": 2,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course is not offered this year.",
        "longinfo": "This course is not offered this year."
    },
    {
        "name": "Spanish 1",
        "number": "0320",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "For students with little or no background in the Spanish language, this is an intensive introductory course. Students learn the fundamentals of spoken and written Spanish. Through active engagement in basic classroom discussions, which are conducted almost exclusively in Spanish, and through the use of a multi- faceted textbook and print and audio-visual materials, students begin to understand and speak Spanish. Simple readings as well as writing exercises on topical subjects complement the course to cultivate a fluency in the written language and a preliminary appreciation of Hispanic cultures.",
        "longinfo": "For students with little or no background in the Spanish language, this is an intensive introductory course. Students learn the fundamentals of spoken and written Spanish. Through active engagement in basic classroom discussions, which are conducted almost exclusively in Spanish, and through the use of a multi- faceted textbook and print and audio-visual materials, students begin to understand and speak Spanish. Simple readings as well as writing exercises on topical subjects complement the course to cultivate a fluency in the written language and a preliminary appreciation of Hispanic cultures."
    },
    {
        "name": "Spanish 2",
        "number": "0321",
        "sections": "4",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "A continuation of the work begun in Middle School or Spanish I, this course aims to increase students' mastery of the oral and written language. Students will increase their grammar and vocabulary knowledge with a focus on bettering their comprehension and fluency. To this end, the reading and written assignments of this class will be more complex and students will be asked to begin to synthesize their knowledge of the language by giving short oral presentations and written compositions.",
        "longinfo": "A continuation of the work begun in Middle School or Spanish I, this course aims to increase students' mastery of the oral and written language. Students will increase their grammar and vocabulary knowledge with a focus on bettering their comprehension and fluency. To this end, the reading and written assignments of this class will be more complex and students will be asked to begin to synthesize their knowledge of the language by giving short oral presentations and written compositions."
    },
    {
        "name": "Spanish 2H",
        "number": "0322",
        "sections": "2",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "The Honors Spanish II class has the same objectives as Spanish II but moves at a more rapid pace and will focus on the acquisition of more complex grammar elements and the development of a larger vocabulary. Supplemental literary readings, and longer writing and speaking assignments are also required at this level. This class is taught almost entirely in Spanish.",
        "longinfo": "The Honors Spanish II class has the same objectives as Spanish II but moves at a more rapid pace and will focus on the acquisition of more complex grammar elements and the development of a larger vocabulary. Supplemental literary readings, and longer writing and speaking assignments are also required at this level. This class is taught almost entirely in Spanish."
    },
    {
        "name": "Spanish 3",
        "number": "0323",
        "sections": "5",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Spanish III includes a review of basic and intermediate structures within a rich cultural context. Instruction progresses to more extensive practice with advanced grammatical elements, idiomatic expressions, and practical vocabulary. Students are asked to incorporate grammar and vocabulary elements to compose short compositions and give multiple oral presentations. While some reading passages are included to develop comprehension and build vocabulary, the main emphasis is on oral proficiency. By the middle of the second trimester, this class is taught entirely in Spanish.",
        "longinfo": "Spanish III includes a review of basic and intermediate structures within a rich cultural context. Instruction progresses to more extensive practice with advanced grammatical elements, idiomatic expressions, and practical vocabulary. Students are asked to incorporate grammar and vocabulary elements to compose short compositions and give multiple oral presentations. While some reading passages are included to develop comprehension and build vocabulary, the main emphasis is on oral proficiency. By the middle of the second trimester, this class is taught entirely in Spanish."
    },
    {
        "name": "Spanish 3H",
        "number": "0324",
        "sections": "2",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "Conducted entirely in Spanish, this course stresses a thorough review of previously studied structures, advanced grammar, extensive oral practice, reading comprehension, and composition. Selections from works by major Hispanic authors that represent a variety of genres are also studied and discussed. This course is, in essence, a Pre-AP class and students who excel will be recommended for AP Spanish Language and Culture for the following year.",
        "longinfo": "Conducted entirely in Spanish, this course stresses a thorough review of previously studied structures, advanced grammar, extensive oral practice, reading comprehension, and composition. Selections from works by major Hispanic authors that represent a variety of genres are also studied and discussed. This course is, in essence, a Pre-AP class and students who excel will be recommended for AP Spanish Language and Culture for the following year."
    },
    {
        "name": "Spanish 4",
        "number": "0325",
        "sections": "4",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Spanish IV is designed to foster continued development of oral and written proficiency in Spanish. The four language skills—listening, speaking, reading and writing—are developed within a variety of classroom activities, such as debates and presentations. Topics for readings, discussion and student developed blogs reflect cultural topics and current events in the Spanish-speaking world. Short videos, newspaper articles and cultural readings, and compositions with appropriate grammar review aid further linguistic development.",
        "longinfo": "Spanish IV is designed to foster continued development of oral and written proficiency in Spanish. The four language skills—listening, speaking, reading and writing—are developed within a variety of classroom activities, such as debates and presentations. Topics for readings, discussion and student developed blogs reflect cultural topics and current events in the Spanish-speaking world. Short videos, newspaper articles and cultural readings, and compositions with appropriate grammar review aid further linguistic development."
    },
    {
        "name": "Spanish 4H",
        "number": "0326",
        "sections": "2",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "This course in advanced oral and written proficiency is offered to students who have truly excelled in Spanish III, as well as to Spanish III Honors students who maintained a B average, and who may need more practice before continuing to the AP level. This course, conducted entirely in Spanish, offers students additional opportunities to refine their skills and to improve their proficiency in speaking and in writing. While video and audio materials provide opportunities for discussion and writing, literary texts provide an introduction to literary discourse and analysis. Increased oral and written proficiency is the main objective of the class and advanced grammar topics are reviewed to facilitate this development. The reading of a full-length literary text and trip to see the production staged is a highlight of the year.",
        "longinfo": "This course in advanced oral and written proficiency is offered to students who have truly excelled in Spanish III, as well as to Spanish III Honors students who maintained a B average, and who may need more practice before continuing to the AP level. This course, conducted entirely in Spanish, offers students additional opportunities to refine their skills and to improve their proficiency in speaking and in writing. While video and audio materials provide opportunities for discussion and writing, literary texts provide an introduction to literary discourse and analysis. Increased oral and written proficiency is the main objective of the class and advanced grammar topics are reviewed to facilitate this development. The reading of a full-length literary text and trip to see the production staged is a highlight of the year."
    },
    {
        "name": "AP Spanish Language and Culture",
        "number": "0329",
        "sections": "2",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "Students who enter this college level course are considered Spanish proficient and will work to become fluent by mastering advanced grammar, colloquial speech, idioms, and an extensive vocabulary. To this end, the course is conducted entirely in Spanish and works on the refinement and sophistication of both written and spoken language skills. While grammatical elements will be reviewed, this is a secondary component to the authentic use of the language. A variety of authentic written and audio-visual materials, including Hispanic texts and movies, are the basis for class activities, which include: extensive classroom discussion, oral presentations, and both formal and informal writing. All activities will serve to prepare students for the Advanced Placement examination in Spanish Language and Culture.",
        "longinfo": "Students who enter this college level course are considered Spanish proficient and will work to become fluent by mastering advanced grammar, colloquial speech, idioms, and an extensive vocabulary. To this end, the course is conducted entirely in Spanish and works on the refinement and sophistication of both written and spoken language skills. While grammatical elements will be reviewed, this is a secondary component to the authentic use of the language. A variety of authentic written and audio-visual materials, including Hispanic texts and movies, are the basis for class activities, which include: extensive classroom discussion, oral presentations, and both formal and informal writing. All activities will serve to prepare students for the Advanced Placement examination in Spanish Language and Culture."
    },
    {
        "name": "Spanish Seminar",
        "number": "0332",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Conducted entirely in Spanish, this full-year elective course is a topical study of different cultural elements and moments in history relating to the Hispanic World. Using film, articles, short literary works, and other audio-visual components, the class will take a discussion style format as students debate, inquire, and make connections to better understand the very diverse cultures of Spanish-speaking countries. The course is divided by trimester to allow for study of Spain, Latin America, and the Hispanic and Latino communities in the United States. Topics that are covered include flamenco, the bull fight, the drastic changes that have occurred in Spain since the end of Francisco Franco’s dictatorial rule, the Spanish conquest of the Americas, Latin American revolutions and independence, US intervention in Latin America, magical-realism, gastronomy, art, and immigration. Assessment for this class is based on formal and informal expression, both written and spoken, and consists primarily of: class participation, oral presentations, essays, and quizzes.",
        "longinfo": "Conducted entirely in Spanish, this full-year elective course is a topical study of different cultural elements and moments in history relating to the Hispanic World. Using film, articles, short literary works, and other audio-visual components, the class will take a discussion style format as students debate, inquire, and make connections to better understand the very diverse cultures of Spanish-speaking countries. The course is divided by trimester to allow for study of Spain, Latin America, and the Hispanic and Latino communities in the United States. Topics that are covered include flamenco, the bull fight, the drastic changes that have occurred in Spain since the end of Francisco Franco’s dictatorial rule, the Spanish conquest of the Americas, Latin American revolutions and independence, US intervention in Latin America, magical-realism, gastronomy, art, and immigration. Assessment for this class is based on formal and informal expression, both written and spoken, and consists primarily of: class participation, oral presentations, essays, and quizzes."
    },
    {
        "name": "Spanish through the Lens: Hispanic Film",
        "number": "0333",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Students continue to develop their language skills through the study and analysis of Hispanic films and related cultural modes of production. During this course of study, conducted in Spanish, students view and discuss films, as well as read literature (e.g. poetry, excerpts of novels, essays, short stories) related to each cinematographic work. Student progress is assessed through analytical dialog, essays, presentations, as well as comprehension quizzes. Relevant grammar is reviewed contextually through these films and related works. The study of several films per trimester will represent a diverse vision of the Hispanic world. The course serves as an introduction to interdisciplinary studies in preparation for university work.",
        "longinfo": "Students continue to develop their language skills through the study and analysis of Hispanic films and related cultural modes of production. During this course of study, conducted in Spanish, students view and discuss films, as well as read literature (e.g. poetry, excerpts of novels, essays, short stories) related to each cinematographic work. Student progress is assessed through analytical dialog, essays, presentations, as well as comprehension quizzes. Relevant grammar is reviewed contextually through these films and related works. The study of several films per trimester will represent a diverse vision of the Hispanic world. The course serves as an introduction to interdisciplinary studies in preparation for university work."
    },
    {
        "name": "Ancient Greek A",
        "number": "0350",
        "sections": "1",
        "department": 2,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This entry-level half-credit course covers the fundamentals of the ancient Greek language and conveys a synopsis of the history, culture, and literature of the ancient Greeks. The textbook combines a thematic, story-based approach with structured grammar. In addition to learning basic rules of grammar and memorizing vocabulary, students will come to understand the relevance and scope of Greek derivation in the English language. Students will deepen their acquaintance with the classical world as the class explores how Greek mythology, philosophy, literature, science, and art have jointly shaped the foundations of Western civilization.",
        "longinfo": "This entry-level half-credit course covers the fundamentals of the ancient Greek language and conveys a synopsis of the history, culture, and literature of the ancient Greeks. The textbook combines a thematic, story-based approach with structured grammar. In addition to learning basic rules of grammar and memorizing vocabulary, students will come to understand the relevance and scope of Greek derivation in the English language. Students will deepen their acquaintance with the classical world as the class explores how Greek mythology, philosophy, literature, science, and art have jointly shaped the foundations of Western civilization."
    },
    {
        "name": "Ancient Greek B",
        "number": "0352",
        "sections": "1",
        "department": 2,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This half-credit course continues the work begun in Ancient Greek A. Students complete the study of the grammar and vocabulary essential for moving on to reading authentic Greek. The cultural emphasis of this class rests on the early history and mythology of the ancient Greeks. Starting in the second trimester, the class will read some of Herodotus’ most compelling accounts in the Histories about protagonists in the Greco-Persian wars, and, time permitting, selected passages from the first book of Homer’s Iliad.",
        "longinfo": "This half-credit course continues the work begun in Ancient Greek A. Students complete the study of the grammar and vocabulary essential for moving on to reading authentic Greek. The cultural emphasis of this class rests on the early history and mythology of the ancient Greeks. Starting in the second trimester, the class will read some of Herodotus’ most compelling accounts in the Histories about protagonists in the Greco-Persian wars, and, time permitting, selected passages from the first book of Homer’s Iliad."
    },
    {
        "name": "Italian 1",
        "number": "0355",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Italian I provides an introduction to Italian language and culture through a communicative and interactive approach. Active participation in class is an integral part of the course. Students will learn about Italy within the European and World context, how students and people live, eat, and study in Italy, and what they do on a daily basis. Students will be engaged in a series of gradually more challenging tasks, through different activities in listening, speaking, reading and writing in every meeting. By the end of the first year students will have acquired the basics of Italian grammar and be able to converse primarily about everyday situations.",
        "longinfo": "Italian I provides an introduction to Italian language and culture through a communicative and interactive approach. Active participation in class is an integral part of the course. Students will learn about Italy within the European and World context, how students and people live, eat, and study in Italy, and what they do on a daily basis. Students will be engaged in a series of gradually more challenging tasks, through different activities in listening, speaking, reading and writing in every meeting. By the end of the first year students will have acquired the basics of Italian grammar and be able to converse primarily about everyday situations."
    },
    {
        "name": "Italian 2",
        "number": "0356",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Italian 2, or Intermediate, is the second year of instruction for those students who have taken Italian 1. In their second year of Italian, the students continue the acquisition of the language in a communicative, yet more systematic way. Italian reality is presented through a variety of passages, articles, and poems aimed at familiarizing the students with culture and civilization while, at the same time, easing the transition from beginning to intermediate Italian. A review of topics is systematically built in, as the students progress forward into new topics and vocabulary.",
        "longinfo": "Italian 2, or Intermediate, is the second year of instruction for those students who have taken Italian 1. In their second year of Italian, the students continue the acquisition of the language in a communicative, yet more systematic way. Italian reality is presented through a variety of passages, articles, and poems aimed at familiarizing the students with culture and civilization while, at the same time, easing the transition from beginning to intermediate Italian. A review of topics is systematically built in, as the students progress forward into new topics and vocabulary."
    },
    {
        "name": "Italian 3",
        "number": "0357",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "In Italian 3 students advance their mastery of Italian language and culture through in depth exposure to grammatical and syntactical aspects of the language. A variety of original sources alongside a textbook are used in class to guarantee students are exposed to the linguistic wealth of Italian and its different cultures. By the end of the third year, students will be able to sustain extended, articulate conversations completely in Italian on a variety of topics, all taken from authentic sources, as well as give individual presentations to the class. They will also be able to write short essay both about themselves and other topics i.e. Italian history, the relationships between the US and Italy, contemporary social issues, such as the environment, Immigrants, the economy, Italian success stories etc.",
        "longinfo": "In Italian 3 students advance their mastery of Italian language and culture through in depth exposure to grammatical and syntactical aspects of the language. A variety of original sources alongside a textbook are used in class to guarantee students are exposed to the linguistic wealth of Italian and its different cultures. By the end of the third year, students will be able to sustain extended, articulate conversations completely in Italian on a variety of topics, all taken from authentic sources, as well as give individual presentations to the class. They will also be able to write short essay both about themselves and other topics i.e. Italian history, the relationships between the US and Italy, contemporary social issues, such as the environment, Immigrants, the economy, Italian success stories etc."
    },
    {
        "name": "Italian 4",
        "number": "0358",
        "sections": "1",
        "department": 2,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Level 4 Italian students have reached a level of competency that allows them to read literary texts chosen from 19th and 20th century Italian poetry and prose. The Internet provides students with direct access to countless sites in Italian, be it universities, art societies, museums, research centers, or firms. Guided discussions, essays and other projects give students an opportunity to create connections with Italian history and society, and how they relate to the present day. This, along with students’ previously acquired knowledge of regional and city differences, will allow them to understand, compare and contrast the many regional variations among Italians.",
        "longinfo": "Level 4 Italian students have reached a level of competency that allows them to read literary texts chosen from 19th and 20th century Italian poetry and prose. The Internet provides students with direct access to countless sites in Italian, be it universities, art societies, museums, research centers, or firms. Guided discussions, essays and other projects give students an opportunity to create connections with Italian history and society, and how they relate to the present day. This, along with students’ previously acquired knowledge of regional and city differences, will allow them to understand, compare and contrast the many regional variations among Italians."
    },
    {
        "name": "Italian 4X",
        "number": "0363",
        "sections": "1",
        "department": 2,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Level 4 Italian students have reached a level of competency that allows them to read literary texts chosen from 19th and 20th century Italian poetry and prose. The Internet provides students with direct access to countless sites in Italian, be it universities, art societies, museums, research centers, or firms. Guided discussions, essays and other projects give students an opportunity to create connections with Italian history and society, and how they relate to the present day. This, along with students’ previously acquired knowledge of regional and city differences, will allow them to understand, compare and contrast the many regional variations among Italians.",
        "longinfo": "Level 4 Italian students have reached a level of competency that allows them to read literary texts chosen from 19th and 20th century Italian poetry and prose. The Internet provides students with direct access to countless sites in Italian, be it universities, art societies, museums, research centers, or firms. Guided discussions, essays and other projects give students an opportunity to create connections with Italian history and society, and how they relate to the present day. This, along with students’ previously acquired knowledge of regional and city differences, will allow them to understand, compare and contrast the many regional variations among Italians."
    },
    {
        "name": "Algebra 1",
        "number": "0411",
        "sections": "2",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This is an Upper Division course designed for those students who have yet to master a full, rigorous Algebra I program. Horace Mann students who took Math 8B in the eighth grade must take this course, and many ninth grade students new to Horace Mann are also appropriate candidates. The core topics are designed to help students gain the algebraic foothold they will need to be successful in the upper level courses. Special emphasis is placed on helping students develop problem-solving techniques they will be able to use in future courses.",
        "longinfo": "This is an Upper Division course designed for those students who have yet to master a full, rigorous Algebra I program. Horace Mann students who took Math 8B in the eighth grade must take this course, and many ninth grade students new to Horace Mann are also appropriate candidates. The core topics are designed to help students gain the algebraic foothold they will need to be successful in the upper level courses. Special emphasis is placed on helping students develop problem-solving techniques they will be able to use in future courses."
    },
    {
        "name": "Geometry",
        "number": "0420",
        "sections": "8",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The course is designed to convey an appreciation of geometry as a deductive system. Starting with undefined terms, postulates, and definitions, the students follow the progressive development of theorems and their proofs to create a mathematical structure with rich aesthetic and practical value. In building this axiomatic structure, they improve their ability to recognize and organize the various relationships among points, lines, triangles, polygons, and circles in the plane. Throughout the year, students will engage in a series of guided explorations using the dynamic software program, Geometer’s Sketchpad.",
        "longinfo": "The course is designed to convey an appreciation of geometry as a deductive system. Starting with undefined terms, postulates, and definitions, the students follow the progressive development of theorems and their proofs to create a mathematical structure with rich aesthetic and practical value. In building this axiomatic structure, they improve their ability to recognize and organize the various relationships among points, lines, triangles, polygons, and circles in the plane. Throughout the year, students will engage in a series of guided explorations using the dynamic software program, Geometer’s Sketchpad."
    },
    {
        "name": "Geometry Honors",
        "number": "0421",
        "sections": "3",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "In addition to the major topics of Geometry, the Honors sections study the advanced geometry of the triangle. After using the dynamic geometry software Geometer’s Sketchpad to conjecture relationships in triangles, students prove theorems associated with the orthocenter, incenter, circumcenter and centroid. Throughout the course great emphasis is placed on proof and the skills associated with effective communication of complex ideas. The year culminates in a final project in which pairs of students present the proof of a “great” theorem during a full class period.",
        "longinfo": "In addition to the major topics of Geometry, the Honors sections study the advanced geometry of the triangle. After using the dynamic geometry software Geometer’s Sketchpad to conjecture relationships in triangles, students prove theorems associated with the orthocenter, incenter, circumcenter and centroid. Throughout the course great emphasis is placed on proof and the skills associated with effective communication of complex ideas. The year culminates in a final project in which pairs of students present the proof of a “great” theorem during a full class period."
    },
    {
        "name": "Algebra 2 & Trigonometry",
        "number": "0430",
        "sections": "9",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The thematic thread that ties this course together is the mathematical concept of a function. Students learn to interpret functions algebraically and graphically, as well as how to connect the two. Functions of particular interest are the sine, cosine, exponential, logarithmic, linear, quadratic, and absolute value. There is a substantial treatment of trigonometry and complex numbers. The course is presented in a spirit of investigation, facilitated by the use of the graphing calculator. Skill-building is emphasized as students learn to attack problems with a toolbox of acquired algorithms. Of equal importance, students encounter open-ended problem-solving in which they learn how to devise their own strategies for tackling non- routine problems.",
        "longinfo": "The thematic thread that ties this course together is the mathematical concept of a function. Students learn to interpret functions algebraically and graphically, as well as how to connect the two. Functions of particular interest are the sine, cosine, exponential, logarithmic, linear, quadratic, and absolute value. There is a substantial treatment of trigonometry and complex numbers. The course is presented in a spirit of investigation, facilitated by the use of the graphing calculator. Skill-building is emphasized as students learn to attack problems with a toolbox of acquired algorithms. Of equal importance, students encounter open-ended problem-solving in which they learn how to devise their own strategies for tackling non- routine problems."
    },
    {
        "name": "Algebra 2 & Trigonometry Honors",
        "number": "0431",
        "sections": "3",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "This Honors course covers the topics in Algebra II & Trigonometry in greater depth, and will also cover additional topics such as group and field theory, matrices, analytic geometry, and sizes of infinity. This is a demanding course, requiring a high level of abstraction and mathematical maturity. Students will be expected to stretch themselves intellectually and to grapple with exciting, difficult material throughout the year.",
        "longinfo": "This Honors course covers the topics in Algebra II & Trigonometry in greater depth, and will also cover additional topics such as group and field theory, matrices, analytic geometry, and sizes of infinity. This is a demanding course, requiring a high level of abstraction and mathematical maturity. Students will be expected to stretch themselves intellectually and to grapple with exciting, difficult material throughout the year."
    },
    {
        "name": "Precalculus",
        "number": "0440",
        "sections": "2",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "One of the major goals of this course is to improve the problem-solving skills of our students. The course begins with a review of trigonometric functions, their graphs, and their inverses. This is followed by a comprehensive study of the Law of Sines and the Law of Cosines that culminates in an in-depth unit on TI-84 programming. The year continues with units covering the conic sections, combinatorics, and probability. The year concludes with a study of exponential growth and decay with specific applications to finance and medicine.",
        "longinfo": "One of the major goals of this course is to improve the problem-solving skills of our students. The course begins with a review of trigonometric functions, their graphs, and their inverses. This is followed by a comprehensive study of the Law of Sines and the Law of Cosines that culminates in an in-depth unit on TI-84 programming. The year continues with units covering the conic sections, combinatorics, and probability. The year concludes with a study of exponential growth and decay with specific applications to finance and medicine."
    },
    {
        "name": "Precalculus AB",
        "number": "0441",
        "sections": "6",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course lays the foundation for a college-level course of Advanced Placement Calculus AB. The central theme is a combination of theoretical study and practical applications of the elementary functions, including trigonometric, polynomial, exponential, logarithmic, and sequential functions. In addition, the course includes an extended unit on combinatorics and probability.",
        "longinfo": "This course lays the foundation for a college-level course of Advanced Placement Calculus AB. The central theme is a combination of theoretical study and practical applications of the elementary functions, including trigonometric, polynomial, exponential, logarithmic, and sequential functions. In addition, the course includes an extended unit on combinatorics and probability."
    },
    {
        "name": "PreCalculus BC Honors",
        "number": "0442",
        "sections": "3",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "This course involves a highly theoretical, rigorous approach to the mathematics of Precalculus. Topics include vector analysis, modeling with parametric equations, combinatorics and probability, sequences and series, recursion, polar coordinates, and an introduction to differential calculus. Graphing calculators are used for exploration. Each student is expected to do a project (the equivalent of a term paper) in the third trimester.",
        "longinfo": "This course involves a highly theoretical, rigorous approach to the mathematics of Precalculus. Topics include vector analysis, modeling with parametric equations, combinatorics and probability, sequences and series, recursion, polar coordinates, and an introduction to differential calculus. Graphing calculators are used for exploration. Each student is expected to do a project (the equivalent of a term paper) in the third trimester."
    },
    {
        "name": "Contemporary Calculus",
        "number": "0450",
        "sections": "2",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This calculus course is paced to allow both depth and exploration. The graphing calculator is used as a tool to examine the topics included in a traditional introductory calculus course: functions and their graphs; limits; the derivative and its applications; definite and indefinite integrals; and logarithmic, exponential, and trigonometric functions. In addition, students study topics not usually accessible in traditional calculus courses. Through calculator exercises students take advantage of numerical methods to analyze problems, discover underlying concepts, and gain insight into the relationship between the geometric and algebraic representation of the central ideas.",
        "longinfo": "This calculus course is paced to allow both depth and exploration. The graphing calculator is used as a tool to examine the topics included in a traditional introductory calculus course: functions and their graphs; limits; the derivative and its applications; definite and indefinite integrals; and logarithmic, exponential, and trigonometric functions. In addition, students study topics not usually accessible in traditional calculus courses. Through calculator exercises students take advantage of numerical methods to analyze problems, discover underlying concepts, and gain insight into the relationship between the geometric and algebraic representation of the central ideas."
    },
    {
        "name": "AP Calculus AB",
        "number": "0451",
        "sections": "5",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "A rigorous introduction to Calculus, this course covers the concepts of differentiation and integration, with applications to rates of change, optimization, area, and volume. One semester of college calculus credit may be earned from this course. This course culminates in the AP Calculus AB exam in the spring.",
        "longinfo": "A rigorous introduction to Calculus, this course covers the concepts of differentiation and integration, with applications to rates of change, optimization, area, and volume. One semester of college calculus credit may be earned from this course. This course culminates in the AP Calculus AB exam in the spring."
    },
    {
        "name": "AP Calculus BC Honors",
        "number": "0452",
        "sections": "3",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "The culmination of the honors sequence in mathematics, this course is taken in preparation for the Calculus BC examination of the College Board. All of the work covered in Calculus AB is included as well as additional topics in special methods of integration, infinite series, polar coordinates, arc lengths, and vectors and parametric equations. Two semesters of college calculus credit may be earned from this course.",
        "longinfo": "The culmination of the honors sequence in mathematics, this course is taken in preparation for the Calculus BC examination of the College Board. All of the work covered in Calculus AB is included as well as additional topics in special methods of integration, infinite series, polar coordinates, arc lengths, and vectors and parametric equations. Two semesters of college calculus credit may be earned from this course."
    },
    {
        "name": "Introduction to Statistics and Probability",
        "number": "0460",
        "sections": "1",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "We are bombarded daily with numerical information in news, in advertisements, and even in conversation. This course will begin with a unit on combinatorics (counting principles) and probability that will help to build a foundation for exploring and applying methods in statistical analysis. Students will learn how to collect data effectively, how to analyze data numerically and graphically, and how to use their analyses to decide whether claims based on numerical information are reasonable.",
        "longinfo": "We are bombarded daily with numerical information in news, in advertisements, and even in conversation. This course will begin with a unit on combinatorics (counting principles) and probability that will help to build a foundation for exploring and applying methods in statistical analysis. Students will learn how to collect data effectively, how to analyze data numerically and graphically, and how to use their analyses to decide whether claims based on numerical information are reasonable."
    },
    {
        "name": "AP Statistics",
        "number": "0462",
        "sections": "3",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "This course is an introductory statistics course similar to those required for college majors in the social sciences, health sciences, and business. In preparation for the Advanced Placement Statistics examination of the College Board, this course introduces the major concepts and tools for collecting, analyzing, and drawing conclusions from data. One semester of college statistics credit may be earned from this course.",
        "longinfo": "This course is an introductory statistics course similar to those required for college majors in the social sciences, health sciences, and business. In preparation for the Advanced Placement Statistics examination of the College Board, this course introduces the major concepts and tools for collecting, analyzing, and drawing conclusions from data. One semester of college statistics credit may be earned from this course."
    },
    {
        "name": "Math Seminar",
        "number": "0470",
        "sections": "2",
        "department": 3,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "This is a full-credit course designed for students with a serious interest in pursuing higher mathematics. The course is problem-set based to give students the experience of working through complex material in an independent setting. The special topics offered vary from year to year and have, to date, included number theory, inversive geometry, linear algebra, multivariable calculus, finite calculus, continued fractions, game theory, and advanced problem-solving.",
        "longinfo": "This is a full-credit course designed for students with a serious interest in pursuing higher mathematics. The course is problem-set based to give students the experience of working through complex material in an independent setting. The special topics offered vary from year to year and have, to date, included number theory, inversive geometry, linear algebra, multivariable calculus, finite calculus, continued fractions, game theory, and advanced problem-solving."
    },
    {
        "name": "Biology",
        "number": "0520",
        "sections": "12",
        "department": 4,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The course provides a survey of the major areas of inquiry in biology including molecular biology, genetics, physiology, behavior, evolution, and ecology. Students design and test hypotheses, collect and analyze data, and draw conclusions during double laboratory periods every week to support their understanding of biological phenomena. Students also explore current research including cutting edge discoveries through reading, debate, and discussion.",
        "longinfo": "The course provides a survey of the major areas of inquiry in biology including molecular biology, genetics, physiology, behavior, evolution, and ecology. Students design and test hypotheses, collect and analyze data, and draw conclusions during double laboratory periods every week to support their understanding of biological phenomena. Students also explore current research including cutting edge discoveries through reading, debate, and discussion."
    },
    {
        "name": "Biotechnology",
        "number": "0522",
        "sections": "2",
        "department": 4,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Students will explore the historical, technical, and social developments associated with various advances in biotechnology. Areas of study will include fermentation, antibiotic production and resistance, DNA sequencing and fingerprinting, DNA amplification by polymerase chain reaction, the Human Genome Project, genetic testing, genetically modified organisms, gene therapy, and immunology. The class will have a lecture/discussion/laboratory format, with the goal of imparting literacy in the technologies, controversies, and challenges emerging from such capabilities.",
        "longinfo": "Students will explore the historical, technical, and social developments associated with various advances in biotechnology. Areas of study will include fermentation, antibiotic production and resistance, DNA sequencing and fingerprinting, DNA amplification by polymerase chain reaction, the Human Genome Project, genetic testing, genetically modified organisms, gene therapy, and immunology. The class will have a lecture/discussion/laboratory format, with the goal of imparting literacy in the technologies, controversies, and challenges emerging from such capabilities."
    },
    {
        "name": "Advanced Topics in Biology",
        "number": "0523",
        "sections": "1",
        "department": 4,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This is a second course in biology for students who wish to explore some topics in biology in greater detail and with greater freedom than a traditional textbook-oriented course. The course will focus on various topics of interest in biology. A majority of class time will be spent in discussion and laboratory experiments, rather than lecture. Students will design and conduct experiments and lead discussions on scientific articles. The course will incorporate aspects of other areas of study, such as engineering, ecology, physiology, physics, chemistry and history. Specific topics vary from year to year. Examples of past topics include: the biology of food; urban ecology and biodiversity; exercise physiology; bacteriology and microbiology and animal behavior. The class may also include field trips and guest speakers to enrich and supplement studies in the course.",
        "longinfo": "This is a second course in biology for students who wish to explore some topics in biology in greater detail and with greater freedom than a traditional textbook-oriented course. The course will focus on various topics of interest in biology. A majority of class time will be spent in discussion and laboratory experiments, rather than lecture. Students will design and conduct experiments and lead discussions on scientific articles. The course will incorporate aspects of other areas of study, such as engineering, ecology, physiology, physics, chemistry and history. Specific topics vary from year to year. Examples of past topics include: the biology of food; urban ecology and biodiversity; exercise physiology; bacteriology and microbiology and animal behavior. The class may also include field trips and guest speakers to enrich and supplement studies in the course."
    },
    {
        "name": "AP Biology",
        "number": "0525",
        "sections": "4",
        "department": 4,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "The AP Biology course places a strong emphasis on overarching themes in biology, and is organized into a conceptual framework consisting of four Big Ideas. ",
        "longinfo": "The AP Biology course places a strong emphasis on overarching themes in biology, and is organized into a conceptual framework consisting of four Big Ideas. They are: 1) Evolution drives the diversity of life; 2) Biological systems utilize free energy and molecular building blocks to grow, to reproduce, and to maintain dynamic homeostasis; 3) Living systems store, retrieve, transmit, and respond to information; and 4) Biological systems interact with each other and with the environment. To bring these concepts to life we study detailed examples taken from human and plant physiology, molecular and cellular biology, genetics, ecology, and evolution. Class discussions incorporate the analysis and interpretation of primary data, and emphasize current areas of scientific research. Inquiry driven labs are used to support student learning. Many of these labs are multi-week and allow students the freedom to design an experiment within the context of the investigation, while learning a variety of techniques used in biological research. Students are required to take the AP Biology exam at the conclusion of the course.\n"
    },
    {
        "name": "Chemistry",
        "number": "0530",
        "sections": "11",
        "department": 4,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Chemistry concerns the composition and properties of matter. The topics discussed in the classroom are explored through demonstrations and reinforced through weekly laboratories. Topics include atomic and electronic structure, bonding, reactions, stoichiometry, gas laws, states of matter, solutions, reaction kinetics, thermodynamics, equilibrium, acids and bases, electrochemistry, organic chemistry, and nuclear chemistry.",
        "longinfo": "Chemistry concerns the composition and properties of matter. The topics discussed in the classroom are explored through demonstrations and reinforced through weekly laboratories. Topics include atomic and electronic structure, bonding, reactions, stoichiometry, gas laws, states of matter, solutions, reaction kinetics, thermodynamics, equilibrium, acids and bases, electrochemistry, organic chemistry, and nuclear chemistry."
    },
    {
        "name": "Experiments in Physics and Chemistry",
        "number": "0532",
        "sections": "1",
        "department": 4,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course is designed for those students who are interested in exploring topics in chemistry and physics from an experimental perspective. This full-year elective explores topics in a way that encourages independent thought and provides direct experience with scientific investigation. It also stresses presenting scientific findings in oral and written form. The course consists of five to seven units investigating topics such as analytical chemistry; chemical synthesis; organic chemistry; forensics; novel materials; mechanics; waves, sound, and light; analog and digital circuits; energy; and atmospheric science. In the third trimester, students will pursue an independent project on a subject of interest to the student, selected in consultation with the teacher. Although some library-based research will be involved, the major emphasis of the course will be explorations that involve data collection and analysis in the chemistry and physics labs.",
        "longinfo": "This course is designed for those students who are interested in exploring topics in chemistry and physics from an experimental perspective. This full-year elective explores topics in a way that encourages independent thought and provides direct experience with scientific investigation. It also stresses presenting scientific findings in oral and written form. The course consists of five to seven units investigating topics such as analytical chemistry; chemical synthesis; organic chemistry; forensics; novel materials; mechanics; waves, sound, and light; analog and digital circuits; energy; and atmospheric science. In the third trimester, students will pursue an independent project on a subject of interest to the student, selected in consultation with the teacher. Although some library-based research will be involved, the major emphasis of the course will be explorations that involve data collection and analysis in the chemistry and physics labs."
    },
    {
        "name": "AP Chemistry",
        "number": "0535",
        "sections": "3",
        "department": 4,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "In this course, the equivalent of an introductory college course, considerable emphasis is placed on the quantitative aspects of chemistry as well as on sophisticated experimentation. The topics covered are similar to those in the introductory chemistry course, but on a much deeper level. They include chemical bonding, stoichiometry, gas laws, solutions, atomic and nuclear chemistry, thermodynamics, reaction kinetics, equilibrium, acids and bases, oxidation-reduction, and organic chemistry. The laboratory work incorporates a variety of techniques supported by analytical equipment. Extensive problem-solving skills are needed to master this course. Students are required to take the AP Chemistry examination at the conclusion of the course.",
        "longinfo": "In this course, the equivalent of an introductory college course, considerable emphasis is placed on the quantitative aspects of chemistry as well as on sophisticated experimentation. The topics covered are similar to those in the introductory chemistry course, but on a much deeper level. They include chemical bonding, stoichiometry, gas laws, solutions, atomic and nuclear chemistry, thermodynamics, reaction kinetics, equilibrium, acids and bases, oxidation-reduction, and organic chemistry. The laboratory work incorporates a variety of techniques supported by analytical equipment. Extensive problem-solving skills are needed to master this course. Students are required to take the AP Chemistry examination at the conclusion of the course."
    },
    {
        "name": "Physics",
        "number": "0540",
        "sections": "7",
        "department": 4,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Physics is an algebra-based course with a focus on mastering fundamental principles and developing scientific reasoning and problem-solving skills. Students learn to apply their conceptual understanding and mathematical skills in solving a broad range of problems. The course includes a weekly laboratory to reinforce the concepts learned in class and to provide an opportunity for students to experience the process of scientific inquiry first hand. Topics covered include Newtonian mechanics, thermodynamics, electricity and magnetism, waves, optics, and atomic and nuclear physics.",
        "longinfo": "Physics is an algebra-based course with a focus on mastering fundamental principles and developing scientific reasoning and problem-solving skills. Students learn to apply their conceptual understanding and mathematical skills in solving a broad range of problems. The course includes a weekly laboratory to reinforce the concepts learned in class and to provide an opportunity for students to experience the process of scientific inquiry first hand. Topics covered include Newtonian mechanics, thermodynamics, electricity and magnetism, waves, optics, and atomic and nuclear physics."
    },
    {
        "name": "Physics Honors",
        "number": "0541",
        "sections": "2",
        "department": 4,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "Physics Honors is an introductory non-calculus college physics course covering Newtonian mechanics, simple harmonic motion, fluids, thermodynamics, electricity and magnetism, waves, optics, and atomic and nuclear physics. Extensive use is made of algebra, trigonometry, and graphical methods. The laboratory section is similar to that of Physics, but places a greater emphasis on independent projects and the writing of scientific papers. At the conclusion of this course, students take the AP Physics 1 and AP Physics 2 examinations. This course is for students who are prepared for and interested in exploring physics more deeply than in Physics (0540).",
        "longinfo": "Physics Honors is an introductory non-calculus college physics course covering Newtonian mechanics, simple harmonic motion, fluids, thermodynamics, electricity and magnetism, waves, optics, and atomic and nuclear physics. Extensive use is made of algebra, trigonometry, and graphical methods. The laboratory section is similar to that of Physics, but places a greater emphasis on independent projects and the writing of scientific papers. At the conclusion of this course, students take the AP Physics 1 and AP Physics 2 examinations. This course is for students who are prepared for and interested in exploring physics more deeply than in Physics (0540)."
    },
    {
        "name": "Selected Topics in Physics",
        "number": "0543",
        "sections": "1",
        "department": 4,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Students select their area of emphasis within large themes that are selected by the instructor. One theme is considered each trimester. The themes will be Information and Complexity, a new and exciting study in science which considers systems that are more than the sum of their parts, self-evolving systems, cellular automata, and the underlying principles of thermodynamics and atomic and nuclear physics; Energy and Climate, which is built on the discussion of thermodynamics and understandings of energy sources such as oil, coal, gas, wind, solar, hydropower and nuclear, as well as evolving environmental, economic and political developments; and Weapons, a study of the physics of weapons of mass destruction including nuclear, biological, chemical and cyberweapons. ",
        "longinfo": "Students select their area of emphasis within large themes that are selected by the instructor. One theme is considered each trimester. The themes will be Information and Complexity, a new and exciting study in science which considers systems that are more than the sum of their parts, self-evolving systems, cellular automata, and the underlying principles of thermodynamics and atomic and nuclear physics; Energy and Climate, which is built on the discussion of thermodynamics and understandings of energy sources such as oil, coal, gas, wind, solar, hydropower and nuclear, as well as evolving environmental, economic and political developments; and Weapons, a study of the physics of weapons of mass destruction including nuclear, biological, chemical and cyberweapons. All themes include discussions of the political, economic and social implications of recent findings in science. Questions of art and design feature prominently in the discussions during the first two trimesters and contribute to student projects throughout. Students write several in-class essays, one review of a museum exhibit, film or play, and complete two self-defined projects each trimester. Readings and videos are assigned. There are no tests. Participation in class discussions and their on-line extensions is required and is considered in the grade. This course does not fulfill the Physics prerequisite for AP Science courses."
    },
    {
        "name": "AP Physics",
        "number": "0545",
        "sections": "2",
        "department": 4,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "AP Physics is a calculus-based treatment of physics concepts in mechanics and in electricity and magnetism. All calculus techniques are discussed before they are applied. Topics discussed include motion, Newton’s laws, conservation of energy and momentum, gravitation, rotation and angular momentum, oscillations, electric and magnetic fields (including Gauss’s law and Ampere’s law), static and moving charges, circuits, and electromagnetism (including Faraday’s law). Ideas from introductory physics are amplified and more broadly applied, and new ideas are introduced.",
        "longinfo": "AP Physics is a calculus-based treatment of physics concepts in mechanics and in electricity and magnetism. All calculus techniques are discussed before they are applied. Topics discussed include motion, Newton’s laws, conservation of energy and momentum, gravitation, rotation and angular momentum, oscillations, electric and magnetic fields (including Gauss’s law and Ampere’s law), static and moving charges, circuits, and electromagnetism (including Faraday’s law). Ideas from introductory physics are amplified and more broadly applied, and new ideas are introduced.\nConcepts are developed and reinforced by measurements, modeling exercises, and applications in the laboratory. Modeling is done with spreadsheets or with software such as vPython and EasyJava Simulations, which are available at no cost online. Phenomena are sometimes filmed and then analyzed with iMovie and Tracker, another Open Source program. Lab reports are required periodically in a format usually used in college-level physics courses. Students submit problem sets most weeks, and take unit exams every three weeks or so. Students are required to take the AP Physics C exams in Mechanics and in Electricity and Magnetism at the conclusion of the course. A final project may be assigned in lieu of a final exam."
    },
    {
        "name": "Science Research Half",
        "number": "0550",
        "sections": "2",
        "department": 4,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This is not a “course” in the usual sense of the word; it is an opportunity for students interested in designing and executing their own research projects.",
        "longinfo": "This is not a “course” in the usual sense of the word; it is an opportunity for students interested in designing and executing their own research projects. What students will do will depend on their needs and interests:\r 1) Students who are pondering a project for the first time will design and complete small-scale projects that they may complete here at school or at home, with an eye toward finding a research\r mentor for the following summer.\r 2) Others may already be working in a research lab part-time and will continue that work, or perhaps have completed research. Those students will prepare for various local and national science fairs or for competitions such as the Intel science competition.\rSome common activities range from project presentations during class as well as readings from the scientific literature on topics related to individual projects. All students must participate in SciTech, a science and technology celebration, which is held in mid-April at Horace Mann."
    },
    {
        "name": "Science Research Full",
        "number": "0552",
        "sections": "1",
        "department": 4,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This is not a “course” in the usual sense of the word; it is an opportunity for students interested in designing and executing their own research projects.",
        "longinfo": "This is not a “course” in the usual sense of the word; it is an opportunity for students interested in designing and executing their own research projects. What students will do will depend on their needs and interests:\r 1) Students who are pondering a project for the first time will design and complete small-scale projects that they may complete here at school or at home, with an eye toward finding a research\r mentor for the following summer.\r 2) Others may already be working in a research lab part-time and will continue that work, or perhaps have completed research. Those students will prepare for various local and national science fairs or for competitions such as the Intel science competition.\rSome common activities range from project presentations during class as well as readings from the scientific literature on topics related to individual projects. All students must participate in SciTech, a science and technology celebration, which is held in mid-April at Horace Mann."
    },
    {
        "name": "AP Environmental Science",
        "number": "0570",
        "sections": "1",
        "department": 4,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "AP Environmental Science is the equivalent of a one-semester, introductory college course in environmental science. The course is interdisciplinary, with elements of geology, ecology, environmental studies, chemistry, and physics. The course stresses scientific principles in the analysis of issues. The goal is to prepare the student with the tools required to understand interrelationships of the natural world in order to be able to evaluate environmental problems and solutions. Pressing issues of today—global climate change, loss of biodiversity, overpopulation, water supply—are a sample of topics covered. Although the course is designed to enable students to undertake more advanced study of environmental science, it is also a strong foundation for those students who will use its lessons in many other fields of study. Students are required to take the AP Environmental Science exam at the conclusion of the course.",
        "longinfo": "AP Environmental Science is the equivalent of a one-semester, introductory college course in environmental science. The course is interdisciplinary, with elements of geology, ecology, environmental studies, chemistry, and physics. The course stresses scientific principles in the analysis of issues. The goal is to prepare the student with the tools required to understand interrelationships of the natural world in order to be able to evaluate environmental problems and solutions. Pressing issues of today—global climate change, loss of biodiversity, overpopulation, water supply—are a sample of topics covered. Although the course is designed to enable students to undertake more advanced study of environmental science, it is also a strong foundation for those students who will use its lessons in many other fields of study. Students are required to take the AP Environmental Science exam at the conclusion of the course."
    },
    {
        "name": "Digital Publishing",
        "number": "0614",
        "sections": "1",
        "department": 5,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 18,
        "shortinfo": "Students enrolled in this course will study and practice in developing interactive media for the Web utilizing HTML5, JavaScript, CSS, and web publishing applications. Introductory skills will be covered using industry standard software to create, edit, and process digital media content for use in specific applications such as interactive web sites, nonlinear, and linear productions. Students will also learn the use of professional desktop publishing software for developing electronic media products. Students will apply the principles of typography and graphic design to develop documents, which combine text, graphics, and photographs on a printed page and in electronic formats. Adobe InDesign CS6 and Adobe Photoshop CS6 will be used as the main applications in addition to iBooks Author and other cloud based publishing software.",
        "longinfo": "Students enrolled in this course will study and practice in developing interactive media for the Web utilizing HTML5, JavaScript, CSS, and web publishing applications. Introductory skills will be covered using industry standard software to create, edit, and process digital media content for use in specific applications such as interactive web sites, nonlinear, and linear productions. Students will also learn the use of professional desktop publishing software for developing electronic media products. Students will apply the principles of typography and graphic design to develop documents, which combine text, graphics, and photographs on a printed page and in electronic formats. Adobe InDesign CS6 and Adobe Photoshop CS6 will be used as the main applications in addition to iBooks Author and other cloud based publishing software."
    },
    {
        "name": "Introduction to Microcontrollers and Robotics",
        "number": "0619",
        "sections": "1",
        "department": 5,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 18,
        "shortinfo": "Ever wonder how all those electronic gadgets work? Curious about what makes a robot work or what is inside the brick that controls the robot? This course will introduce engineering alongside programming concepts.",
        "longinfo": "Ever wonder how all those electronic gadgets work? Curious about what makes a robot work or what is inside the brick that controls the robot? This course will introduce engineering alongside programming concepts. Start the year learning to make electronic gadgets using the Arduino microcontroller and a variety of sensors, motors and LEDs. Later in the year class transitions to the Tetrix building system to design and program robots that are similar in size and form to robots built by the Horace Mann robotics teams. Students should anticipate documenting their work in a journal, using 3D modeling software, coding in compiled programming languages and spending time in the lab finishing their projects.\nThis course would be an appropriate entry point for a ninth grader interested in joining the robotics team. The robotics team participates in the F.I.R.S.T. program in the Tech Challenge. This course would also be an appropriate intermediate level course following CS1 for those students who enjoyed the engineering section of the introductory course."
    },
    {
        "name": "Computer Science 1",
        "number": "0620",
        "sections": "9",
        "department": 5,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 18,
        "shortinfo": "The FUNdamentals of Computer Science takes you beyond being just a user of technology, you become the producer by studying the insides of the computer from hardware to software. In this course students will learn about the principles of computer science in a hands-on environment that includes plenty of time to explore and create. Topics will include Internet security and safety, data representation, exposure to programming principles (HTML, JavaScript, CSS, Arduino, JA V A, Scratch and/or Snap!). Using computers is easy when you've got the basics, but this course will teach you the magic that goes on in the box.",
        "longinfo": "The FUNdamentals of Computer Science takes you beyond being just a user of technology, you become the producer by studying the insides of the computer from hardware to software. In this course students will learn about the principles of computer science in a hands-on environment that includes plenty of time to explore and create. Topics will include Internet security and safety, data representation, exposure to programming principles (HTML, JavaScript, CSS, Arduino, JA V A, Scratch and/or Snap!). Using computers is easy when you've got the basics, but this course will teach you the magic that goes on in the box."
    },
    {
        "name": "Computer Science 2",
        "number": "0621",
        "sections": "3",
        "department": 5,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 18,
        "shortinfo": "Take a journey from the 1980's to the 2000's through the eyes of a computer scientist. In this intermediate- level course students will learn about object-oriented design, one and two dimensional data structures, and recursion while exploring the history of the user-interface from console driven keyboard programs to modern day event driven devices. Projects may involve creating arcade games, making a Facebook-like application, drawing fractals and making an Android application.",
        "longinfo": "Take a journey from the 1980's to the 2000's through the eyes of a computer scientist. In this intermediate- level course students will learn about object-oriented design, one and two dimensional data structures, and recursion while exploring the history of the user-interface from console driven keyboard programs to modern day event driven devices. Projects may involve creating arcade games, making a Facebook-like application, drawing fractals and making an Android application."
    },
    {
        "name": "AP Computer Science",
        "number": "0623",
        "sections": "2",
        "department": 5,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 18,
        "shortinfo": "The Horace Mann AP Computer Science course prepares students for the most current AP Computer Science exam and in addition teaches content consistent with most college and university CS1 and CS2 courses. The course topics include study of algorithms and data structures including linked lists, sets, maps, queues, stacks, trees, and hash tables. The course is taught using the Java programming language. Students are expected to take the AP exam at the end of the year. The department recommends students take this course after completing Computer Science II.",
        "longinfo": "The Horace Mann AP Computer Science course prepares students for the most current AP Computer Science exam and in addition teaches content consistent with most college and university CS1 and CS2 courses. The course topics include study of algorithms and data structures including linked lists, sets, maps, queues, stacks, trees, and hash tables. The course is taught using the Java programming language. Students are expected to take the AP exam at the end of the year. The department recommends students take this course after completing Computer Science II."
    },
    {
        "name": "Introduction to Art History: The Renaissance",
        "number": "0702",
        "sections": "2",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course is designed to provide a foundational knowledge of artists, genres, techniques, works, and comprehensive context(s) of the Renaissance in both Southern and Northern Europe. Seminal works of art will be explored in depth and students will be given the opportunity to ponder canonic images by artists such as Raphael, Michelangelo, Leonardo, Hieronymus Bosch, and Pieter Bruegel the Elder. Along with a greater understanding of history, students will gain the ability to “read” Renaissance images. Architecture and museum assignments are a vital and exciting portion of this course.",
        "longinfo": "This course is designed to provide a foundational knowledge of artists, genres, techniques, works, and comprehensive context(s) of the Renaissance in both Southern and Northern Europe. Seminal works of art will be explored in depth and students will be given the opportunity to ponder canonic images by artists such as Raphael, Michelangelo, Leonardo, Hieronymus Bosch, and Pieter Bruegel the Elder. Along with a greater understanding of history, students will gain the ability to “read” Renaissance images. Architecture and museum assignments are a vital and exciting portion of this course."
    },
    {
        "name": "Introduction to Art History: History of Contemporary Art",
        "number": "0703",
        "sections": "4",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course introduces students to architecture, painting, sculpture, and other media created by artists from the 19th century to the present. The course provides an in-depth study of the origins of Modernism, and allows students to explore works by artists such as Edouard Manet, Claude Monet, Mary Cassat, Vincent Van Gogh, Pablo Picasso, Jackson Pollock, Frank Lloyd Wright, Donald Judd, Barbara Kruger, and many others. Works are placed in the social, political and cultural context of their production, offering students an understanding of modern history in addition to the crucial skills of formal analysis. Museum, and various NYC site visits are an exciting requirement of this course.",
        "longinfo": "This course introduces students to architecture, painting, sculpture, and other media created by artists from the 19th century to the present. The course provides an in-depth study of the origins of Modernism, and allows students to explore works by artists such as Edouard Manet, Claude Monet, Mary Cassat, Vincent Van Gogh, Pablo Picasso, Jackson Pollock, Frank Lloyd Wright, Donald Judd, Barbara Kruger, and many others. Works are placed in the social, political and cultural context of their production, offering students an understanding of modern history in addition to the crucial skills of formal analysis. Museum, and various NYC site visits are an exciting requirement of this course."
    },
    {
        "name": "Studies in Art History",
        "number": "0710",
        "sections": "2",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Studies in Art History is designed for students who discover an interest in the discipline of Art History outside or beyond the AP curriculum. The topic-based course offers students the opportunity to delve in- depth into a particular subject in an advanced seminar setting. Museum visits and other in-person engagements with works of art are an integral part of this course.",
        "longinfo": "Studies in Art History is designed for students who discover an interest in the discipline of Art History outside or beyond the AP curriculum. The topic-based course offers students the opportunity to delve in- depth into a particular subject in an advanced seminar setting. Museum visits and other in-person engagements with works of art are an integral part of this course."
    },
    {
        "name": "History of Photography",
        "number": "0712",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "This course will present an overview of the major historical and critical issues in 19th, 20th and early 21st century photography. We will explore contemporary uses of photography, including the impact of digital imagery and the World Wide Web. As a medium, photography is closely linked to cultural, scientific and technological developments. We will examine photography’s history and status as an art form, as a vehicle for social issues, and as a technological practice. Students will complete reading assignments and project research, and will make presentations to the class. We will examine such recurring themes as “Art or Technology” and “Document or Fiction.” Questions regarding the role of photography in constructing notions of reality and of racial, sexual and gender identity will be addressed. There will be a final project in lieu of a final exam.",
        "longinfo": "This course will present an overview of the major historical and critical issues in 19th, 20th and early 21st century photography. We will explore contemporary uses of photography, including the impact of digital imagery and the World Wide Web. As a medium, photography is closely linked to cultural, scientific and technological developments. We will examine photography’s history and status as an art form, as a vehicle for social issues, and as a technological practice. Students will complete reading assignments and project research, and will make presentations to the class. We will examine such recurring themes as “Art or Technology” and “Document or Fiction.” Questions regarding the role of photography in constructing notions of reality and of racial, sexual and gender identity will be addressed. There will be a final project in lieu of a final exam."
    },
    {
        "name": "AP Art History",
        "number": "0719",
        "sections": "2",
        "department": 6,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "This course is largely based on the standards set by the College Board as well as the typical college art history 101 course. However, students must expect supplemental projects and experiences that take advantage of the museum and gallery resources of New York City. The course will consider art beginning with the Ancient Near East and will end with a discussion of early 21st century digital art. Topics will include art and culture both from the European tradition and beyond the European tradition. Of special interest students will serve as docents in the Metropolitan Museum of Art, guiding our entire 8th grade through the East Asian Collection of Hindu and Buddhist Art.",
        "longinfo": "This course is largely based on the standards set by the College Board as well as the typical college art history 101 course. However, students must expect supplemental projects and experiences that take advantage of the museum and gallery resources of New York City. The course will consider art beginning with the Ancient Near East and will end with a discussion of early 21st century digital art. Topics will include art and culture both from the European tradition and beyond the European tradition. Of special interest students will serve as docents in the Metropolitan Museum of Art, guiding our entire 8th grade through the East Asian Collection of Hindu and Buddhist Art."
    },
    {
        "name": "Ceramics I",
        "number": "0731",
        "sections": "3",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "This course is an introduction to ceramics. Basic clay forming techniques will be explored, including pinch, coil, slab construction, and the potter’s wheel. Students will learn the basics of using clay as a vehicle for self-expression, focusing on utilitarian and sculptural forms. Students will acquire the basic skills and technical knowledge needed to gain an understanding of the nature of working in the ceramics medium.",
        "longinfo": "This course is an introduction to ceramics. Basic clay forming techniques will be explored, including pinch, coil, slab construction, and the potter’s wheel. Students will learn the basics of using clay as a vehicle for self-expression, focusing on utilitarian and sculptural forms. Students will acquire the basic skills and technical knowledge needed to gain an understanding of the nature of working in the ceramics medium."
    },
    {
        "name": "Ceramics II",
        "number": "0732",
        "sections": "2",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "This course is an introduction to the potters wheel and will build upon the knowledge gained in Ceramics I. Functional and sculptural wheel thrown pottery will be explored, as well as glazes, slips, and other decoration techniques. This course focuses on technique and skill-building while leaving room for the student’s own creative input.",
        "longinfo": "This course is an introduction to the potters wheel and will build upon the knowledge gained in Ceramics I. Functional and sculptural wheel thrown pottery will be explored, as well as glazes, slips, and other decoration techniques. This course focuses on technique and skill-building while leaving room for the student’s own creative input."
    },
    {
        "name": "Ceramics III",
        "number": "0733",
        "sections": "2",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "Each year, Advanced Level III ceramics students will engage in activities that focus on specific aspects of working in the ceramics medium. Topics will vary and rotate from year to year. Possible topics may include: Multimedia Ceramics, Ceramics and the Printed Image, Mold Making & Casting, Tableware, Ceramic Sculpture, 2D Ceramics, Glaze Formulation, Alternative Firing Techniques, Site Specific Sculpture, or Architectural Ceramics.",
        "longinfo": "Each year, Advanced Level III ceramics students will engage in activities that focus on specific aspects of working in the ceramics medium. Topics will vary and rotate from year to year. Possible topics may include: Multimedia Ceramics, Ceramics and the Printed Image, Mold Making & Casting, Tableware, Ceramic Sculpture, 2D Ceramics, Glaze Formulation, Alternative Firing Techniques, Site Specific Sculpture, or Architectural Ceramics."
    },
    {
        "name": "Ceramics IV",
        "number": "0734",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "Advanced Ceramics IV students work on an independent-study basis. Through research and consultation, students will develop their own series of assignments and projects. Creative problem-solving and self- expression are paramount. This course requires students to be self-motivated and seek out answers to their own questions. Students will develop, discuss, and exhibit their artwork throughout the school year.",
        "longinfo": "Advanced Ceramics IV students work on an independent-study basis. Through research and consultation, students will develop their own series of assignments and projects. Creative problem-solving and self- expression are paramount. This course requires students to be self-motivated and seek out answers to their own questions. Students will develop, discuss, and exhibit their artwork throughout the school year."
    },
    {
        "name": "CeramicsH",
        "number": "0737",
        "sections": "1",
        "department": 6,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 12,
        "shortinfo": "This course is a continuation of Ceramics IV.",
        "longinfo": "This course is a continuation of Ceramics IV."
    },
    {
        "name": "Introduction to Drawing & Painting I",
        "number": "0751",
        "sections": "4",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "An introduction to the fundamentals of art, this course develops \"visual literacy\" through the study of basic design concepts: line, shape, color, etc. Along with learning traditional conventions of representation, students are encouraged to develop the confidence and ability to express their individual and unique perceptions. Course work includes studio and out-of-class assignments. The boundaries of materials and techniques are open and can include varieties of approaches such as drawing with string or painting with light; or perhaps, even wind.",
        "longinfo": "An introduction to the fundamentals of art, this course develops \"visual literacy\" through the study of basic design concepts: line, shape, color, etc. Along with learning traditional conventions of representation, students are encouraged to develop the confidence and ability to express their individual and unique perceptions. Course work includes studio and out-of-class assignments. The boundaries of materials and techniques are open and can include varieties of approaches such as drawing with string or painting with light; or perhaps, even wind."
    },
    {
        "name": "Drawing & Painting II",
        "number": "0752",
        "sections": "2",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "This course is designed to acquaint students with universal principles and cultural specifics of the pictorial arts. Sequential lessons will tell the story of our shared pictorial heritage, with an emphasis on concepts, history, themes and selected mediums. Students will create artwork that illustrates and enhances the ideas covered in class. Attention to artistic scholarship, fine craft and skill development will be emphasized. The artwork produced will of course be reflective of each student’s personality and special interests and strengths. However, this is not a course of personal expression for the sake of expression alone. In this class students will be expected to learn specific approaches and techniques in the spirit of artistic inquiry; through that discipline, creative individuality will come.",
        "longinfo": "This course is designed to acquaint students with universal principles and cultural specifics of the pictorial arts. Sequential lessons will tell the story of our shared pictorial heritage, with an emphasis on concepts, history, themes and selected mediums. Students will create artwork that illustrates and enhances the ideas covered in class. Attention to artistic scholarship, fine craft and skill development will be emphasized. The artwork produced will of course be reflective of each student’s personality and special interests and strengths. However, this is not a course of personal expression for the sake of expression alone. In this class students will be expected to learn specific approaches and techniques in the spirit of artistic inquiry; through that discipline, creative individuality will come."
    },
    {
        "name": "Drawing & Painting III",
        "number": "0753",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "This is an advanced course in the techniques and media of drawing and painting. This course is for students seriously interested in developing their abilities. This course allows students the opportunity to concentrate on individual projects in preparation for the A.P. level.",
        "longinfo": "This is an advanced course in the techniques and media of drawing and painting. This course is for students seriously interested in developing their abilities. This course allows students the opportunity to concentrate on individual projects in preparation for the A.P. level."
    },
    {
        "name": "Drawing & Painting IV",
        "number": "0754",
        "sections": "2",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "Drawing and Painting IV allows the advanced student to continue working on personal vision projects. The instructor will be available for advice and technical help in the realization of this vision; however, the student is responsible for the design of the projects undertaken. The student will share the work on a regular basis with other classes working in the same discipline. The personal projects will be shown as part of the end-of-the-year show, and are also eligible for application to juried shows during the year.",
        "longinfo": "Drawing and Painting IV allows the advanced student to continue working on personal vision projects. The instructor will be available for advice and technical help in the realization of this vision; however, the student is responsible for the design of the projects undertaken. The student will share the work on a regular basis with other classes working in the same discipline. The personal projects will be shown as part of the end-of-the-year show, and are also eligible for application to juried shows during the year."
    },
    {
        "name": "Drawing & Painting V",
        "number": "0755",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "This course is a continuation of Drawing and Painting IV.",
        "longinfo": "This course is a continuation of Drawing and Painting IV."
    },
    {
        "name": "Drawing & Painting Honors",
        "number": "0757",
        "sections": "1",
        "department": 6,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 12,
        "shortinfo": "This course is a continuation of Drawing and Painting V.",
        "longinfo": "This course is a continuation of Drawing and Painting V."
    },
    {
        "name": "AP Studio",
        "number": "0759",
        "sections": "1",
        "department": 6,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 12,
        "shortinfo": "Does this course even exist?",
        "longinfo": "Does this course even exist?"
    },
    {
        "name": "Photography I",
        "number": "0761",
        "sections": "3",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "When everyone is taking pictures, what makes someone a photographer? Photographers possess a sophisticated level of knowledge, understanding and skill. This course introduces the basic technical and aesthetic concerns of photography, visual thinking, personal expression, camera handling and darkroom procedures. Students will use Single Lens Reflex cameras, both film-based and digital. The “hands-on” experience is supplemented with classroom discussions, lectures, slides, demonstrations, and readings. Topics include defining a subject, the principles of exposure and contrast, film development, digital capture, file management and printmaking. Darkroom time during school hours is an integral part of the course. Field trips to galleries and exhibitions are planned when possible. Students must have access to a 35mm film camera with manual controls and must purchase their own film and printing paper. Digital SLR cameras can be borrowed from the School. Financial assistance is available to qualifying students to provide equipment and materials.",
        "longinfo": "When everyone is taking pictures, what makes someone a photographer? Photographers possess a sophisticated level of knowledge, understanding and skill. This course introduces the basic technical and aesthetic concerns of photography, visual thinking, personal expression, camera handling and darkroom procedures. Students will use Single Lens Reflex cameras, both film-based and digital. The “hands-on” experience is supplemented with classroom discussions, lectures, slides, demonstrations, and readings. Topics include defining a subject, the principles of exposure and contrast, film development, digital capture, file management and printmaking. Darkroom time during school hours is an integral part of the course. Field trips to galleries and exhibitions are planned when possible. Students must have access to a 35mm film camera with manual controls and must purchase their own film and printing paper. Digital SLR cameras can be borrowed from the School. Financial assistance is available to qualifying students to provide equipment and materials."
    },
    {
        "name": "Photography II",
        "number": "0762",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "Students are encouraged to expand their understanding of the possibilities of photography as an artistic medium while continuing to refine their technical skills and individual interests. The course explores various approaches to photography including documentary, narrative, constructed image, experimental and digital imaging. Sensitivity to the qualities of light and control of lighting conditions are also stressed. The basic principles of color photography are presented. Field trips to galleries and exhibitions are planned when possible. Digital SLR cameras can be borrowed from the School. Financial assistance is available to qualifying students to provide equipment and materials.",
        "longinfo": "Students are encouraged to expand their understanding of the possibilities of photography as an artistic medium while continuing to refine their technical skills and individual interests. The course explores various approaches to photography including documentary, narrative, constructed image, experimental and digital imaging. Sensitivity to the qualities of light and control of lighting conditions are also stressed. The basic principles of color photography are presented. Field trips to galleries and exhibitions are planned when possible. Digital SLR cameras can be borrowed from the School. Financial assistance is available to qualifying students to provide equipment and materials."
    },
    {
        "name": "Photography III",
        "number": "0763",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "This course emphasizes individual choice of subject matter and method. Building on a firm understanding of photographic techniques, exposure, film processing, digital capture and printmaking, students are encouraged to investigate the interrelationships of subject, concept, technique and presentation. Class discussions and slides introduce students to special topics in contemporary photographic practice and theory. Each student will create a “body of work” or portfolio which will be discussed in depth by the class. Field trips to galleries and exhibitions are planned when possible. Digital SLR cameras can be borrowed from the School. Financial assistance is available to qualifying students to provide equipment and materials.",
        "longinfo": "This course emphasizes individual choice of subject matter and method. Building on a firm understanding of photographic techniques, exposure, film processing, digital capture and printmaking, students are encouraged to investigate the interrelationships of subject, concept, technique and presentation. Class discussions and slides introduce students to special topics in contemporary photographic practice and theory. Each student will create a “body of work” or portfolio which will be discussed in depth by the class. Field trips to galleries and exhibitions are planned when possible. Digital SLR cameras can be borrowed from the School. Financial assistance is available to qualifying students to provide equipment and materials."
    },
    {
        "name": "Photography IV",
        "number": "0764",
        "sections": "2",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "Photography IV is a continuation of Photo III for qualified students.",
        "longinfo": "Photography IV is a continuation of Photo III for qualified students."
    },
    {
        "name": "Printmaking I",
        "number": "0771",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "This course is an introduction to the printmaking medium. Students will explore traditional printmaking techniques including, woodcuts, etching, rubbing, silkscreen, and photographic silkscreen through a series of challenging assignments. Students will develop their drawing skills, study concepts in composition, learn new techniques, and explore their imaginations in an exciting art studio environment.",
        "longinfo": "This course is an introduction to the printmaking medium. Students will explore traditional printmaking techniques including, woodcuts, etching, rubbing, silkscreen, and photographic silkscreen through a series of challenging assignments. Students will develop their drawing skills, study concepts in composition, learn new techniques, and explore their imaginations in an exciting art studio environment."
    },
    {
        "name": "Printmaking II",
        "number": "0772",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "In this course students will continue to develop their skills and will focus on specific printmaking techniques. Etching techniques such as aquatint, sugar lift, spit bite, and crayon transfer with multicolor etching may be explored. In silkscreen, students may explore four-color processes in photo-silkscreen. And with woodcut, multi-block printing, cut blocks, and airbrushing with stencil prints are explored. Conceptual development, self-expression, meaning/message, an understanding of composition are emphasized.",
        "longinfo": "In this course students will continue to develop their skills and will focus on specific printmaking techniques. Etching techniques such as aquatint, sugar lift, spit bite, and crayon transfer with multicolor etching may be explored. In silkscreen, students may explore four-color processes in photo-silkscreen. And with woodcut, multi-block printing, cut blocks, and airbrushing with stencil prints are explored. Conceptual development, self-expression, meaning/message, an understanding of composition are emphasized."
    },
    {
        "name": "Printmaking III",
        "number": "0773",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "This course provides advanced students with the opportunity to develop their expertise in an area of printmaking which they choose (e.g. woodcut, etching, silk-screen). Methods of making viscosity prints are also introduced. Students are encouraged to explore a particular technique and material in order to express their personal artistic statements. Creative freedom and self expression are paramount.",
        "longinfo": "This course provides advanced students with the opportunity to develop their expertise in an area of printmaking which they choose (e.g. woodcut, etching, silk-screen). Methods of making viscosity prints are also introduced. Students are encouraged to explore a particular technique and material in order to express their personal artistic statements. Creative freedom and self expression are paramount."
    },
    {
        "name": "Printmaking Honors",
        "number": "0777",
        "sections": "1",
        "department": 6,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 12,
        "shortinfo": "This course is a continuation of Printmaking III.",
        "longinfo": "This course is a continuation of Printmaking III."
    },
    {
        "name": "Sculpture I",
        "number": "0781",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "In this course students will explore the elements of three-dimensional design. Traditional sculpture techniques will be explored along with non-traditional and experimental processes. Students will learn to cast, mold, fabricate, and carve a variety of materials including corrugate board construction, paper/paper- pulp, gelatin cast, and working with clay, wood and plaster. Students will develop their technical and conceptual art-making skills within a supportive and creative environment.",
        "longinfo": "In this course students will explore the elements of three-dimensional design. Traditional sculpture techniques will be explored along with non-traditional and experimental processes. Students will learn to cast, mold, fabricate, and carve a variety of materials including corrugate board construction, paper/paper- pulp, gelatin cast, and working with clay, wood and plaster. Students will develop their technical and conceptual art-making skills within a supportive and creative environment."
    },
    {
        "name": "Sculpture II",
        "number": "0782",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "Students will learn to further explore three-dimensional space through the use of mixed media, sound, light, and movement. Students will develop a stronger understanding of the concepts of sculpture and will continue to develop technical skills in casting, carving, and fabricating a wide variety of materials.",
        "longinfo": "Students will learn to further explore three-dimensional space through the use of mixed media, sound, light, and movement. Students will develop a stronger understanding of the concepts of sculpture and will continue to develop technical skills in casting, carving, and fabricating a wide variety of materials."
    },
    {
        "name": "Video Production I",
        "number": "0791",
        "sections": "2",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "Using digital/HD video, the class explores a variety of individual and team projects while learning the language of cinema. Examples culled from Hollywood, Independent and World cinema are examined and incorporated. Students initially work on class assignments, and then create personal and/or group movies. Special effects techniques will be acquired to help create deeper meanings. Learning to master editing in the professional, industry standard of FinalCutProHD, provides individuals with the means to fully achieve their visions.",
        "longinfo": "Using digital/HD video, the class explores a variety of individual and team projects while learning the language of cinema. Examples culled from Hollywood, Independent and World cinema are examined and incorporated. Students initially work on class assignments, and then create personal and/or group movies. Special effects techniques will be acquired to help create deeper meanings. Learning to master editing in the professional, industry standard of FinalCutProHD, provides individuals with the means to fully achieve their visions.\nMovies made in this course have included: action/adventure, claymation, comedies, crime, documentaries, dramas, funny horror, mockumentaries, music videos, socially responsible activist works, abstractions, as well as unique remakes of the great classics."
    },
    {
        "name": "Video Production II",
        "number": "0792",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 12,
        "shortinfo": "Although this course builds on concepts and techniques offered in the 9th and 10th grade video level, one can enroll in the 11th and 12th grade level without that prerequisite.\nBuilding on the above course description, this class will create movies with more sophisticated visual and narrative structures. Students will work with the ‘hidden’ connections between shots, explore advanced sound editing, capture and creation, directing actors, learn lighting set-ups to obtain optimal picture quality, as well as create projects that emphasize crafting elements into a complete whole.",
        "longinfo": "Although this course builds on concepts and techniques offered in the 9th and 10th grade video level, one can enroll in the 11th and 12th grade level without that prerequisite.\nBuilding on the above course description, this class will create movies with more sophisticated visual and narrative structures. Students will work with the ‘hidden’ connections between shots, explore advanced sound editing, capture and creation, directing actors, learn lighting set-ups to obtain optimal picture quality, as well as create projects that emphasize crafting elements into a complete whole."
    },
    {
        "name": "Glee Club",
        "number": "0801",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 100,
        "shortinfo": "The Horace Mann Glee Club has a long tradition of performing choral masterworks, as well as a wide range of choral music from varying countries and traditions. The curriculum focuses on group vocal production, choral blend, lyric diction, phrasing, standard performance, and developing a love for group singing. The ensemble performs four to six times a year, and every member is required to participate in all scheduled dress rehearsals and concerts. Students in all grades may audition for Glee Club.",
        "longinfo": "The Horace Mann Glee Club has a long tradition of performing choral masterworks, as well as a wide range of choral music from varying countries and traditions. The curriculum focuses on group vocal production, choral blend, lyric diction, phrasing, standard performance, and developing a love for group singing. The ensemble performs four to six times a year, and every member is required to participate in all scheduled dress rehearsals and concerts. Students in all grades may audition for Glee Club."
    },
    {
        "name": "Concert Glee Club",
        "number": "0803",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 30,
        "shortinfo": "The Concert Glee Club is a select ensemble open to students in grades 10, 11, and 12 that performs advanced choral literature from both Western and non-Western traditions, vocal jazz, and pop. The ensemble performs eight to ten times a year, both on and off campus. Students are expected to take private lessons while in this ensemble. Participation in all dress rehearsals and concerts is required.",
        "longinfo": "The Concert Glee Club is a select ensemble open to students in grades 10, 11, and 12 that performs advanced choral literature from both Western and non-Western traditions, vocal jazz, and pop. The ensemble performs eight to ten times a year, both on and off campus. Students are expected to take private lessons while in this ensemble. Participation in all dress rehearsals and concerts is required."
    },
    {
        "name": "Wind Ensemble",
        "number": "0811",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 40,
        "shortinfo": "The Wind Ensemble performs both new and standard wind band works. The group performs three major concerts throughout the school year. Advanced members of the Wind Ensemble may be invited to perform additional concerts and repertoire with other ensembles.",
        "longinfo": "The Wind Ensemble performs both new and standard wind band works. The group performs three major concerts throughout the school year. Advanced members of the Wind Ensemble may be invited to perform additional concerts and repertoire with other ensembles."
    },
    {
        "name": "Jazz Combo",
        "number": "0813",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course is for students serious about studying and rehearsing both traditional and contemporary jazz music. The ensemble prepares for numerous performances and serves as a colloquium on the varied performing styles in jazz. Students are expected to take private lessons while in the ensemble. Participation in all dress rehearsals and concerts is required.",
        "longinfo": "This course is for students serious about studying and rehearsing both traditional and contemporary jazz music. The ensemble prepares for numerous performances and serves as a colloquium on the varied performing styles in jazz. Students are expected to take private lessons while in the ensemble. Participation in all dress rehearsals and concerts is required."
    },
    {
        "name": "Steel Drum Ensemble",
        "number": "0815",
        "sections": "3",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This ensemble is designed to expose students to steel drum band works from a variety of musical styles. Students will develop the skills necessary to perform musical works from genres such as samba, calypso, pop and reggae. Some class time will be devoted to exploring the history and social relevance of the steel band movement. The ability to read music is not required, but is helpful, as students will be reading from sheet music. Students are required to perform in three evening concerts during the course of the year.",
        "longinfo": "This ensemble is designed to expose students to steel drum band works from a variety of musical styles. Students will develop the skills necessary to perform musical works from genres such as samba, calypso, pop and reggae. Some class time will be devoted to exploring the history and social relevance of the steel band movement. The ability to read music is not required, but is helpful, as students will be reading from sheet music. Students are required to perform in three evening concerts during the course of the year."
    },
    {
        "name": "Orchestra",
        "number": "0822",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 100,
        "shortinfo": "The orchestra rehearses and performs masterpieces from the Baroque, Classical, Romantic, and Contemporary eras, and its members experience first-hand some of the great musical compositions of Western culture. Concerts each trimester enable students to share the joy of music making both on campus and with audiences in Manhattan. Participation in all dress rehearsals and concerts is required.\r",
        "longinfo": "The orchestra rehearses and performs masterpieces from the Baroque, Classical, Romantic, and Contemporary eras, and its members experience first-hand some of the great musical compositions of Western culture. Concerts each trimester enable students to share the joy of music making both on campus and with audiences in Manhattan. Participation in all dress rehearsals and concerts is required.\r"
    },
    {
        "name": "String Sinfonietta",
        "number": "0823",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The String Sinfonietta’s repertoire covers the entire canon of string orchestra literature from the Baroque to Contemporary. The ensemble performs five to eight times per year, both on and off campus. Private Music lessons are expected and attendance at all dress rehearsals and concert is mandatory.",
        "longinfo": "The String Sinfonietta’s repertoire covers the entire canon of string orchestra literature from the Baroque to Contemporary. The ensemble performs five to eight times per year, both on and off campus. Private Music lessons are expected and attendance at all dress rehearsals and concert is mandatory.\r"
    },
    {
        "name": "History of Music",
        "number": "0830",
        "sections": "2",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course is designed for students who desire to become aware of the role music has played in the formation of Western civilization. We emphasize the evolution of musical styles and concepts in relation to the cultures in which the composers lived. Students are required to listen to music outside class. No previous musical training required.",
        "longinfo": "This course is designed for students who desire to become aware of the role music has played in the formation of Western civilization. We emphasize the evolution of musical styles and concepts in relation to the cultures in which the composers lived. Students are required to listen to music outside class. No previous musical training required."
    },
    {
        "name": "History of Jazz",
        "number": "0840",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The course focuses on the development of Jazz in America as it has manifested itself in cities such as New Orleans, Kansas City, Chicago, and New York. Tracing Jazz’s roots though Ragtime, Big Band, be-bop, and Fusion, the class also covers such legendary performers as Louis Armstrong, Count Basie, Duke Ellington, and Miles Davis. The course utilizes detailed texts and listening materials to help students gain the skills necessary to understand and evaluate jazz music and the way it has made its way through the 20th century. Students should expect occasional guest performances in class, as well as attending one live jazz event as a class.",
        "longinfo": "The course focuses on the development of Jazz in America as it has manifested itself in cities such as New Orleans, Kansas City, Chicago, and New York. Tracing Jazz’s roots though Ragtime, Big Band, be-bop, and Fusion, the class also covers such legendary performers as Louis Armstrong, Count Basie, Duke Ellington, and Miles Davis. The course utilizes detailed texts and listening materials to help students gain the skills necessary to understand and evaluate jazz music and the way it has made its way through the 20th century. Students should expect occasional guest performances in class, as well as attending one live jazz event as a class."
    },
    {
        "name": "Great Music of the 20th Century",
        "number": "0841",
        "sections": "2",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "We all love listening to music, but why do we like some artists and not others? Why do some recordings stand up to repeat listening, while others turn out to be passing fads? From Mahler and Bernstein to Jimi Hendrix and Radiohead, there are common elements that have added to the rich, fertile musical soil we know today. In this course you will learn how to listen more deeply into music to search for answers to these questions. Along the way, we’ll explore select examples of many different genres and expand our knowledge and awareness of contemporary music.",
        "longinfo": "We all love listening to music, but why do we like some artists and not others? Why do some recordings stand up to repeat listening, while others turn out to be passing fads? From Mahler and Bernstein to Jimi Hendrix and Radiohead, there are common elements that have added to the rich, fertile musical soil we know today. In this course you will learn how to listen more deeply into music to search for answers to these questions. Along the way, we’ll explore select examples of many different genres and expand our knowledge and awareness of contemporary music."
    },
    {
        "name": "Music Theory",
        "number": "0850",
        "sections": "2",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 15,
        "shortinfo": "This course focuses on studying, writing and analyzing basic tonal harmony and musical form. Beginning with a survey of music terminology and concepts, students will examine the evolution of Western harmonic vocabulary while being exposed to a wide range of musical styles and works.",
        "longinfo": "This course focuses on studying, writing and analyzing basic tonal harmony and musical form. Beginning with a survey of music terminology and concepts, students will examine the evolution of Western harmonic vocabulary while being exposed to a wide range of musical styles and works."
    },
    {
        "name": "AP Music Theory",
        "number": "0851",
        "sections": "1",
        "department": 6,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "This course is designed for those who wish to pursue one or two musical topics at a very intense and advanced level. Past areas of concentration have been composition, conducting, orchestrating and advanced recording techniques. Students must be highly organized and self-motivated. This is a full-credit course.",
        "longinfo": "This course is designed for those who wish to pursue one or two musical topics at a very intense and advanced level. Past areas of concentration have been composition, conducting, orchestrating and advanced recording techniques. Students must be highly organized and self-motivated. This is a full-credit course."
    },
    {
        "name": "Music Technology",
        "number": "0856",
        "sections": "3",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 15,
        "shortinfo": "This course is a hands-on study of modern music creation utilizing Horace Mann’s Pro Tools equipped recording studio. Students will study the nature of sound and vibrating bodies, sound generating devices, as well as how to record, manipulate, mix, and master music. Previous experience in a performing group or private music lessons and strong computer skills are strongly recommended.",
        "longinfo": "This course is a hands-on study of modern music creation utilizing Horace Mann’s Pro Tools equipped recording studio. Students will study the nature of sound and vibrating bodies, sound generating devices, as well as how to record, manipulate, mix, and master music. Previous experience in a performing group or private music lessons and strong computer skills are strongly recommended."
    },
    {
        "name": "Advanced Studio Production",
        "number": "0857",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The Advanced Studio Production course provides a highly in-depth and hands-on study of recording, mixing and mastering techniques. While the instructor determines the course’s scope and sequence, individual student talents and interests will help to shape the course’s content and breadth. Topics covered will include multi-tracking, pitch correction, compiling alternate takes to create a polished product, the subtleties of microphones types, microphone techniques, and creating lead sheets and rhythm charts for studio musicians.",
        "longinfo": "The Advanced Studio Production course provides a highly in-depth and hands-on study of recording, mixing and mastering techniques. While the instructor determines the course’s scope and sequence, individual student talents and interests will help to shape the course’s content and breadth. Topics covered will include multi-tracking, pitch correction, compiling alternate takes to create a polished product, the subtleties of microphones types, microphone techniques, and creating lead sheets and rhythm charts for studio musicians."
    },
    {
        "name": "Stagecraft in School",
        "number": "0860",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This is a full-year, half-credit course which meets during a regularly scheduled period during the class day. In it students learn how to safely use tools in construction of set pieces, how to hang, focus, and circuit lights, and a variety of other skills related to theatrical scenic technology. Those in this course do not attend after-school classes and are not expected to run the back stage activities for the season’s productions.",
        "longinfo": "This is a full-year, half-credit course which meets during a regularly scheduled period during the class day. In it students learn how to safely use tools in construction of set pieces, how to hang, focus, and circuit lights, and a variety of other skills related to theatrical scenic technology. Those in this course do not attend after-school classes and are not expected to run the back stage activities for the season’s productions."
    },
    {
        "name": "Theatre Design and Production A",
        "number": "0866",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Theater Production Design introduces Upper Division Students to the tools and techniques necessary to the process of designing for the theater as well as designing in other related fields such as interior architecture and themed environments. Areas that will be studied are drafting of plans and elevations, scale model making, color rendering, CAD lighting plots and architectural sketching. Students will work in a variety of media as they explore set, lighting and costume design for the theater. Emphasis will be placed on the tools needed to communicate one’s design concepts using standards common in both the theatre and architecture industries. Completion of the course allows students to be eligible to design for the Horace Mann Theatre Company’s season.",
        "longinfo": "Theater Production Design introduces Upper Division Students to the tools and techniques necessary to the process of designing for the theater as well as designing in other related fields such as interior architecture and themed environments. Areas that will be studied are drafting of plans and elevations, scale model making, color rendering, CAD lighting plots and architectural sketching. Students will work in a variety of media as they explore set, lighting and costume design for the theater. Emphasis will be placed on the tools needed to communicate one’s design concepts using standards common in both the theatre and architecture industries. Completion of the course allows students to be eligible to design for the Horace Mann Theatre Company’s season."
    },
    {
        "name": "Theatre Design and Production B",
        "number": "0867",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This class is a continuation of concepts studied in Theatre Production Design (A). Students work on further refining their skills in drafting, model-making and color-rendering. More in-depth discussions of play and production text are explored and individual assignments may include Main Stage productions.",
        "longinfo": "This class is a continuation of concepts studied in Theatre Production Design (A). Students work on further refining their skills in drafting, model-making and color-rendering. More in-depth discussions of play and production text are explored and individual assignments may include Main Stage productions."
    },
    {
        "name": "Introduction to Modern European and American Theatre",
        "number": "0872",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course will introduce students to all the major trends and styles in Western theatre from the time of Shakespeare to the present. Revenge tragedy, Restoration Comedy, Romanticism, the advent of realism and the experimental theatre of the late 20th century will all be examined in survey form. In-class readings of exemplary playwrights from each era will be used and there will be an emphasis on historical content and the importance of influential individuals.",
        "longinfo": "This course will introduce students to all the major trends and styles in Western theatre from the time of Shakespeare to the present. Revenge tragedy, Restoration Comedy, Romanticism, the advent of realism and the experimental theatre of the late 20th century will all be examined in survey form. In-class readings of exemplary playwrights from each era will be used and there will be an emphasis on historical content and the importance of influential individuals."
    },
    {
        "name": "Introduction to Acting A",
        "number": "0873",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Students with a desire to learn the techniques of a more serious actor/director can audition for this introductory level course. Acting skills covered include physical awareness, stage presence, vocal projection, articulation, character development and risk-taking. Through playful improvisation exercises and increasingly challenging scene and monologue scripts, actors experience the power of their imagination, the strength of their instrument and the enjoyment of being part of a theatrical ensemble. Work is performed for an audience as often as once a trimester, with a final showcase at year’s end. This section of Introduction to Acting is specifically geared to the 9th grade actor with heightened emphasis on imagination, improvisational skills, and physical expressiveness. Students who take this course are prepared for the Acting and Directing B should they choose to continue studying theatre at Horace Mann.",
        "longinfo": "Students with a desire to learn the techniques of a more serious actor/director can audition for this introductory level course. Acting skills covered include physical awareness, stage presence, vocal projection, articulation, character development and risk-taking. Through playful improvisation exercises and increasingly challenging scene and monologue scripts, actors experience the power of their imagination, the strength of their instrument and the enjoyment of being part of a theatrical ensemble. Work is performed for an audience as often as once a trimester, with a final showcase at year’s end. This section of Introduction to Acting is specifically geared to the 9th grade actor with heightened emphasis on imagination, improvisational skills, and physical expressiveness. Students who take this course are prepared for the Acting and Directing B should they choose to continue studying theatre at Horace Mann."
    },
    {
        "name": "Acting and Directing B",
        "number": "0874",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course is for students with a desire to learn a range of techniques for acting and directing. Acting skills covered include physical behavior, stage presence, vocal projection and articulation, character development, text analysis, and risk-taking. Through playful improvisation exercises and increasingly challenging scene and monologue scripts, actors experience the power of their imagination, the strength of their instrument and the enjoyment of being part of a theatrical ensemble. Attending performances outside of Horace Mann in addition to all school productions is a requirement of the course. Work is performed for invited audiences throughout the year with a final showcase at year’s end. Acting and Directing B is specifically geared to the 10th-12th grade actor and may be preceded by Introduction to Acting A. Students who take this course are prepared for the Advanced Acting Seminar should they choose to continue studying theatre at Horace Mann.",
        "longinfo": "This course is for students with a desire to learn a range of techniques for acting and directing. Acting skills covered include physical behavior, stage presence, vocal projection and articulation, character development, text analysis, and risk-taking. Through playful improvisation exercises and increasingly challenging scene and monologue scripts, actors experience the power of their imagination, the strength of their instrument and the enjoyment of being part of a theatrical ensemble. Attending performances outside of Horace Mann in addition to all school productions is a requirement of the course. Work is performed for invited audiences throughout the year with a final showcase at year’s end. Acting and Directing B is specifically geared to the 10th-12th grade actor and may be preceded by Introduction to Acting A. Students who take this course are prepared for the Advanced Acting Seminar should they choose to continue studying theatre at Horace Mann."
    },
    {
        "name": "Seminar in Acting",
        "number": "0875",
        "sections": "1",
        "department": 6,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Students participate in an intense study of various acting techniques. The first part of the course concentrates on an actor's tools through sense and emotion memory, improvisation and basic acting exercises. Scene study and technique are then studied in depth with individual critique and coaching by the instructor. Classic readings by Stanislavski, Boleslavsky, and Robert Lewis are essential to the course. Throughout the year students perform monologues, scenes and, occasionally, short plays.",
        "longinfo": "Students participate in an intense study of various acting techniques. The first part of the course concentrates on an actor's tools through sense and emotion memory, improvisation and basic acting﻿ exercises. Scene study and technique are then studied in depth with individual critique and coaching by the instructor. Classic readings by Stanislavski, Boleslavsky, and Robert Lewis are essential to the course. Throughout the year students perform monologues, scenes and, occasionally, short plays."
    },
    {
        "name": "Playwriting and Production",
        "number": "0877",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Entry to this course is by submission of a short scene and permission of the instructor. Students begin reading plays by American playwrights (Miller, Williams, Vogel) to learn to understand and analyze great writing. Scene writing and guided exercises provide the basis for experimenting with elements of structure, character, rhythm and style. The group collaborates to learn about drafting through performing each other’s work, followed by revising and re-writing. All class members are expected to act in readings and participate in lively discussions on writing techniques. The final project is the writing of a one-act play that may be submitted to the Student-Written One-Act Play Festival. While selected plays are produced every other year in this festival, the course culminates annually in staged readings of each writer’s work.",
        "longinfo": "Entry to this course is by submission of a short scene and permission of the instructor. Students begin reading plays by American playwrights (Miller, Williams, Vogel) to learn to understand and analyze great writing. Scene writing and guided exercises provide the basis for experimenting with elements of structure, character, rhythm and style. The group collaborates to learn about drafting through performing each other’s work, followed by revising and re-writing. All class members are expected to act in readings and participate in lively discussions on writing techniques. The final project is the writing of a one-act play that may be submitted to the Student-Written One-Act Play Festival. While selected plays are produced every other year in this festival, the course culminates annually in staged readings of each writer’s work."
    },
    {
        "name": "Film Studies",
        "number": "0879",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Building on the foundation of Art of the Film, Film Studies investigates selected, more advanced topics dealing with various aspects of cinema.",
        "longinfo": "Building on the foundation of Art of the Film, Film Studies investigates selected, more advanced topics dealing with various aspects of cinema. Each trimester concentrates on two areas of study:\r Trimester I: Cinematic grammar and style, The art of film and auteur theory. Trimester II: Image and text, \rThe soundscape of motion pictures. Trimester III: \r\r\rActors, characterization and dialogue, \rA final research project for each student. \rFunctioning as a seminar, the course assesses students’ contributions to class discussion, presentations, and in-class essays as a basis for a grade. Co-operative learning is emphasized. [Maximum of 12 students]"
    },
    {
        "name": "Art of Film",
        "number": "0880",
        "sections": "5",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course looks at the evolution of film as an art form, concentrating on visual meaning and its eventual conjunction with sound. The contributions of directors, producers, actors, cinematographers, art directors, costume designers, editors, and special-effects people are all examined both through scene study and sometimes through watching an entire film. In addition, the development of a grammar of film and the emergence of genres such as the western, film noir and science-fiction are studied. Quizzes and homework complement the class work; there are occasional in-class essays.\r",
        "longinfo": "This course looks at the evolution of film as an art form, concentrating on visual meaning and its eventual conjunction with sound. The contributions of directors, producers, actors, cinematographers, art directors, costume designers, editors, and special-effects people are all examined both through scene study and sometimes through watching an entire film. In addition, the development of a grammar of film and the emergence of genres such as the western, film noir and science-fiction are studied. Quizzes and homework complement the class work; there are occasional in-class essays.\r"
    },
    {
        "name": "Dance Workshop I (Arts Credit)",
        "number": "0883",
        "sections": "3",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Dance Workshop emphasizes the development of a strong technical base in Ballet, Pilates, Yoga, Modern Dance, Jazz, Tap, Hip-Hop and an awareness of other world dance influences. Training includes warm-up, improvisation, alignment, stretching exercises, and traveling combinations. Rhythmic awareness and the relationship of music to dance is stressed throughout.",
        "longinfo": "There are multiple sections of Dance Workshop. Students are placed not by grade level but according to skill level as assessed by the dance teachers. Placement is also dependent on fitting the section assignment into one’s schedule. Although a student may move from a primary to an intermediate level of dance, it will not be indicated by a separate course number. The transcript will simply show continuing participation in Dance Workshop.\nDance Workshop emphasizes the development of a strong technical base in Ballet, Pilates, Yoga, Modern Dance, Jazz, Tap, Hip-Hop and an awareness of other world dance influences. Training includes warm-up, improvisation, alignment, stretching exercises, and traveling combinations. Rhythmic awareness and the relationship of music to dance is stressed throughout."
    },
    {
        "name": "Dance Workshop II (Arts Credit)",
        "number": "0884",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Dance Workshop emphasizes the development of a strong technical base in Ballet, Pilates, Yoga, Modern Dance, Jazz, Tap, Hip-Hop and an awareness of other world dance influences. Training includes warm-up, improvisation, alignment, stretching exercises, and traveling combinations. Rhythmic awareness and the relationship of music to dance is stressed throughout.",
        "longinfo": "There are multiple sections of Dance Workshop. Students are placed not by grade level but according to skill level as assessed by the dance teachers. Placement is also dependent on fitting the section assignment into one’s schedule. Although a student may move from a primary to an intermediate level of dance, it will not be indicated by a separate course number. The transcript will simply show continuing participation in Dance Workshop.\nDance Workshop emphasizes the development of a strong technical base in Ballet, Pilates, Yoga, Modern Dance, Jazz, Tap, Hip-Hop and an awareness of other world dance influences. Training includes warm-up, improvisation, alignment, stretching exercises, and traveling combinations. Rhythmic awareness and the relationship of music to dance is stressed throughout."
    },
    {
        "name": "Dance Performance",
        "number": "0885",
        "sections": "1",
        "department": 6,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course builds upon the foundations established in Dance Workshop and finally places the emphasis on performance. This culminates in presentations for Book Day, various assemblies and The Tilles Dance Conference at Long Island University.",
        "longinfo": "This course builds upon the foundations established in Dance Workshop and finally places the emphasis on performance. This culminates in presentations for Book Day, various assemblies and The Tilles Dance Conference at Long Island University."
    },
    {
        "name": "Performance in Major Theatre and Dance Productions",
        "number": "0891",
        "sections": "1",
        "department": 6,
        "credits": 0.33,
        "wt": 0.33,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Three fully-staged productions of important examples of world theatre are undertaken each year. Through them, students explore the art of theatre in all of its complexity. The Theatre Company aims to create the most professional productions possible. Actors learn style, interpretive skills, movement, vocal production, and gain experience in making commitments and meeting deadlines.\nThe goal of the Dance Company is to inspire and guide students in all elements of dance, choreography, and performance skills. The dance concert consists of both faculty and student-generated choreography, providing dancers with an optimum rehearsal and performance experience.",
        "longinfo": "Three fully-staged productions of important examples of world theatre are undertaken each year. Through them, students explore the art of theatre in all of its complexity. The Theatre Company aims to create the most professional productions possible. Actors learn style, interpretive skills, movement, vocal production, and gain experience in making commitments and meeting deadlines.\nThe goal of the Dance Company is to inspire and guide students in all elements of dance, choreography, and performance skills. The dance concert consists of both faculty and student-generated choreography, providing dancers with an optimum rehearsal and performance experience."
    },
    {
        "name": "Introduction to Psychology",
        "number": "0900",
        "sections": "2",
        "department": 8,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This year-long course examines the field of psychology, including the theories, research, and applications that constitute the discipline. The goal is to teach students about the science of psychology and to observe the applications in everyday life. Psychology offers the opportunity to better understand one’s own and others’ behaviors, explore a potential career path and encourage intellectual discovery. Specific topics include history of psychology, research, memory, intelligence, mental illness, treatment of psychological disorders, social psychology, and development. The issues and topics will be explored through textbook and supplementary readings, case studies, lectures, discussions, films and guest speakers.",
        "longinfo": "This year-long course examines the field of psychology, including the theories, research, and applications that constitute the discipline. The goal is to teach students about the science of psychology and to observe the applications in everyday life. Psychology offers the opportunity to better understand one’s own and others’ behaviors, explore a potential career path and encourage intellectual discovery. Specific topics include history of psychology, research, memory, intelligence, mental illness, treatment of psychological disorders, social psychology, and development. The issues and topics will be explored through textbook and supplementary readings, case studies, lectures, discussions, films and guest speakers."
    },
    {
        "name": "AP Psychology",
        "number": "0901",
        "sections": "2",
        "department": 8,
        "credits": 1,
        "wt": 1,
        "gpa": 1,
        "size": 20,
        "shortinfo": "This course is designed to represent college-level psychology studies. Students will study various approaches to psychology, types of research in psychology, facets of human behavior and cognition, neuroscience, and the treatment of various disorders. In addition, this course will examine topics in greater depth than the introductory course does, and will present some topics not covered in the introductory course. A strong emphasis will be placed on research within the various subfields of psychology. Independent projects will be required. Materials to prepare for the AP Psychology exam will be provided and practice exams will be offered.",
        "longinfo": "This course is designed to represent college-level psychology studies. Students will study various approaches to psychology, types of research in psychology, facets of human behavior and cognition, neuroscience, and the treatment of various disorders. In addition, this course will examine topics in greater depth than the introductory course does, and will present some topics not covered in the introductory course. A strong emphasis will be placed on research within the various subfields of psychology. Independent projects will be required. Materials to prepare for the AP Psychology exam will be provided and practice exams will be offered."
    },
    {
        "name": "Independent Study",
        "number": "0902",
        "sections": "3",
        "department": 7,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The Independent Interdisciplinary Research Seminar allows motivated, responsible students to study topics not included in the Horace Mann curriculum or to continue research on a topic covered in a previous course. Each student in the IIRS designs a research project and pursues it through independent study guided by a faculty mentor. Students meet with their mentors at least once per week and with the seminar director once every other week. IIRS members also convene twice per week for an interdisciplinary seminar.",
        "longinfo": "The Independent Interdisciplinary Research Seminar allows motivated, responsible students to study topics not included in the Horace Mann curriculum or to continue research on a topic covered in a previous course. Each student in the IIRS designs a research project and pursues it through independent study guided by a faculty mentor. Students meet with their mentors at least once per week and with the seminar director once every other week. IIRS members also convene twice per week for an interdisciplinary seminar.\nAll participants keep journals in which they record their research. Each trimester they must produce evidence of their work, usually a research paper, a literary or artistic work, a scientific experiment, or a performance. The project's content determines the form of the final result. Project grades are commensurate with the Horace Mann grading policy and comprise two-thirds of the trimester grade.\nDuring seminar sessions students teach each other about the knowledge acquired through their independent work. They also discuss a limited number of common readings. The grade for the seminar constitutes one- third of the trimester grade.\n"
    },
    {
        "name": "Ethics in School and Society",
        "number": "0903",
        "sections": "1",
        "department": 8,
        "credits": 1,
        "wt": 1,
        "gpa": 0,
        "size": 20,
        "shortinfo": "What is a good life? What is the purpose of education? How do we understand inequality? Are people naturally selfish, or altruistic? Questions like these are just the beginning of a study of ethics. Should there be a military draft? Should abortion remain legal? Should grading be abolished? Should the legal drinking age be changed? All of these issues have major ethical components.",
        "longinfo": "What is a good life? What is the purpose of education? How do we understand inequality? Are people naturally selfish, or altruistic? Questions like these are just the beginning of a study of ethics. Should there be a military draft? Should abortion remain legal? Should grading be abolished? Should the legal drinking age be changed? All of these issues have major ethical components.\nThis major elective course will serve as a year-long journey through the theory and practice of ethics in school and society. Students will gain a basic understanding of systems of ethics in history, as well as current controversies in ethical thought and action. Along with readings and lectures, classes will include discussion, debates, field trips, video and audio presentations, guest speakers, and an emphasis on student- directed inquiry. In addition, the class will include a service-learning component. We will engage in individual and group projects, at school and in the wider community, in order to act, learn, and reflect on central ethical and moral issues."
    },
    {
        "name": "Identity, Gender and Sexuality",
        "number": "0908",
        "sections": "1",
        "department": 9,
        "credits": 0.5,
        "wt": 0.5,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course aims to provide an introduction to the field of gender and sexuality studies. Central themes of the course will come from modern philosophers. We will use these ideas to inform our understanding of selected literature, film, art, current events, music and pop culture. We will also draw from the expertise of faculty members to explore questions like: How is gender and sexuality expressed and interpreted in different cultures? What role does biology play in examining gender and sexuality? How do race and gender or sexuality intersect? How does language influence identity, or the reverse? Is there a history of sexuality? If so, what is it? Students will leave the course with a framework for understanding how gender and sexuality shape identity.",
        "longinfo": "This course aims to provide an introduction to the field of gender and sexuality studies. Central themes of the course will come from modern philosophers. We will use these ideas to inform our understanding of selected literature, film, art, current events, music and pop culture. We will also draw from the expertise of faculty members to explore questions like: How is gender and sexuality expressed and interpreted in different cultures? What role does biology play in examining gender and sexuality? How do race and gender or sexuality intersect? How does language influence identity, or the reverse? Is there a history of sexuality? If so, what is it? Students will leave the course with a framework for understanding how gender and sexuality shape identity."
    },
    {
        "name": "Horace Mann Orientation",
        "number": "0910",
        "sections": "14",
        "department": 8,
        "credits": 0,
        "wt": 0,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Horace Mann Orientation (HMO) is a required, weekly support and orientation program for 9th grade students in the 1st trimester. This course is primarily intended to foster connections among 9th graders and between them and the 11th and 12th grade Peer Leaders who co-lead the groups with HM faculty members. As students acclimate to the HM Upper Division, this program also offers study skills support and an introduction to HM clubs, community service, and other extracurricular activities. Students also learn to utilize school resources. HMO teachers consist of faculty from various departments, including the Department of Counseling and Guidance, and grade-level deans.",
        "longinfo": "Horace Mann Orientation (HMO) is a required, weekly support and orientation program for 9th grade students in the 1st trimester. This course is primarily intended to foster connections among 9th graders and between them and the 11th and 12th grade Peer Leaders who co-lead the groups with HM faculty members. As students acclimate to the HM Upper Division, this program also offers study skills support and an introduction to HM clubs, community service, and other extracurricular activities. Students also learn to utilize school resources. HMO teachers consist of faculty from various departments, including the Department of Counseling and Guidance, and grade-level deans."
    },
    {
        "name": "Quest",
        "number": "0920",
        "sections": "15",
        "department": 8,
        "credits": 0,
        "wt": 0,
        "gpa": 0,
        "size": 20,
        "shortinfo": "This course is a required, weekly discussion-based seminar for juniors in the 2nd and 3rd trimesters. The discussion topics focus on the theme of self-awareness, especially in relation to larger communities. Quest provides an opportunity for students to reflect on who they are, how they have come to be that way, and who they want to be in the future. By discussing both timeless and current themes and issues, students widen their knowledge of themselves and others, as well as explore their place in the world. The course is facilitated by Counseling & Guidance faculty and faculty from other departments.",
        "longinfo": "This course is a required, weekly discussion-based seminar for juniors in the 2nd and 3rd trimesters. The discussion topics focus on the theme of self-awareness, especially in relation to larger communities. Quest provides an opportunity for students to reflect on who they are, how they have come to be that way, and who they want to be in the future. By discussing both timeless and current themes and issues, students widen their knowledge of themselves and others, as well as explore their place in the world. The course is facilitated by Counseling & Guidance faculty and faculty from other departments."
    },
    {
        "name": "Health Education",
        "number": "0931",
        "sections": "16",
        "department": 8,
        "credits": 0,
        "wt": 0,
        "gpa": 0,
        "size": 20,
        "shortinfo": "The Health Education curriculum provides an interactive forum with students, teachers, and Upper Division Peer Leaders to understand health issues. As students acquire knowledge and obtain skills, they gain the self-confidence and sense of responsibility necessary for making decisions that affect their quality of life. The curriculum builds on basic life-skills training in self-image development and independent thinking, stress management, and effective communication. It includes research, role-playing, guest lectures, written and oral reports, movies, and interactive group discussions. The skills students learn form a basis for exploration in areas such as human growth and development, emotional health, alcohol, tobacco and substance abuse, nutrition, and preventive medicine.",
        "longinfo": "The Health Education curriculum provides an interactive forum with students, teachers, and Upper Division Peer Leaders to understand health issues. As students acquire knowledge and obtain skills, they gain the self-confidence and sense of responsibility necessary for making decisions that affect their quality of life. The curriculum builds on basic life-skills training in self-image development and independent thinking, stress management, and effective communication. It includes research, role-playing, guest lectures, written and oral reports, movies, and interactive group discussions. The skills students learn form a basis for exploration in areas such as human growth and development, emotional health, alcohol, tobacco and substance abuse, nutrition, and preventive medicine."
    },
    {
        "name": "Concepts of Physical Fitness/Team and Life Sport",
        "number": "0955",
        "sections": "20",
        "department": 9,
        "credits": 0,
        "wt": 0,
        "gpa": 0,
        "size": 58,
        "shortinfo": "Students will participate in a program that provides the most up-to-date information on strength- development/conditioning regimens and activities that develop personal living skills, integrate physical skills, and lead toward the objective of selecting appealing physical activities available outside of class.",
        "longinfo": "Students will participate in a program that provides the most up-to-date information on strength- development/conditioning regimens and activities that develop personal living skills, integrate physical skills, and lead toward the objective of selecting appealing physical activities available outside of class.\nIn the weight-training component, students will be taught the proper use of equipment as well as the effects of its use on the body. The Fitlinxx system adds technology to the physical education department as well as aiding the teachers in teaching the students proper technique and use of our Cybex machines. The cardiovascular fitness component will begin with the identification of each student’s target heart rate zone and allow students to achieve it through various endurance and muscle-toning workouts. Students will be “tested out” periodically in order to assess progress, general knowledge of the human anatomy and the equipment used to work specific muscle groups.\nIn the team and life sport component, students will participate in both individual and team sport activities. Students will learn the rules of play of each sport or activity and the fundamental skills necessary for the enjoyment of each. Seasonal offerings include: field hockey, soccer, floor hockey, tennis, golf, horseshoe, bocce, jogging, flag football, volleyball, basketball, softball, speedball, team handball, ultimate frisbee, and childhood playground games."
    },
    {
        "name": "Dance Workshop I (PE Credit)",
        "number": "0957",
        "sections": "3",
        "department": 9,
        "credits": 0,
        "wt": 0,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Dance Workshop emphasizes the development of a strong technical base in Ballet, Pilates, Yoga, Modern Dance, Jazz, Tap, Hip-Hop and an awareness of other world dance influences. Training includes warm-up, improvisation, alignment, stretching exercises, and traveling combinations. Rhythmic awareness and the relationship of music to dance is stressed throughout.",
        "longinfo": "There are multiple sections of Dance Workshop. Students are placed not by grade level but according to skill level as assessed by the dance teachers. Placement is also dependent on fitting the section assignment into one’s schedule. Although a student may move from a primary to an intermediate level of dance, it will not be indicated by a separate course number. The transcript will simply show continuing participation in Dance Workshop.\nDance Workshop emphasizes the development of a strong technical base in Ballet, Pilates, Yoga, Modern Dance, Jazz, Tap, Hip-Hop and an awareness of other world dance influences. Training includes warm-up, improvisation, alignment, stretching exercises, and traveling combinations. Rhythmic awareness and the relationship of music to dance is stressed throughout."
    },
    {
        "name": "Dance Workshop II (PE Credit)",
        "number": "0958",
        "sections": "1",
        "department": 9,
        "credits": 0,
        "wt": 0,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Dance Workshop emphasizes the development of a strong technical base in Ballet, Pilates, Yoga, Modern Dance, Jazz, Tap, Hip-Hop and an awareness of other world dance influences. Training includes warm-up, improvisation, alignment, stretching exercises, and traveling combinations. Rhythmic awareness and the relationship of music to dance is stressed throughout.",
        "longinfo": "There are multiple sections of Dance Workshop. Students are placed not by grade level but according to skill level as assessed by the dance teachers. Placement is also dependent on fitting the section assignment into one’s schedule. Although a student may move from a primary to an intermediate level of dance, it will not be indicated by a separate course number. The transcript will simply show continuing participation in Dance Workshop.\nDance Workshop emphasizes the development of a strong technical base in Ballet, Pilates, Yoga, Modern Dance, Jazz, Tap, Hip-Hop and an awareness of other world dance influences. Training includes warm-up, improvisation, alignment, stretching exercises, and traveling combinations. Rhythmic awareness and the relationship of music to dance is stressed throughout."
    },
    {
        "name": "Dance Workshop III (PE Credit)",
        "number": "0959",
        "sections": "1",
        "department": 9,
        "credits": 0,
        "wt": 0,
        "gpa": 0,
        "size": 20,
        "shortinfo": "Dance Workshop emphasizes the development of a strong technical base in Ballet, Pilates, Yoga, Modern Dance, Jazz, Tap, Hip-Hop and an awareness of other world dance influences. Training includes warm-up, improvisation, alignment, stretching exercises, and traveling combinations. Rhythmic awareness and the relationship of music to dance is stressed throughout.",
        "longinfo": "There are multiple sections of Dance Workshop. Students are placed not by grade level but according to skill level as assessed by the dance teachers. Placement is also dependent on fitting the section assignment into one’s schedule. Although a student may move from a primary to an intermediate level of dance, it will not be indicated by a separate course number. The transcript will simply show continuing participation in Dance Workshop.\nDance Workshop emphasizes the development of a strong technical base in Ballet, Pilates, Yoga, Modern Dance, Jazz, Tap, Hip-Hop and an awareness of other world dance influences. Training includes warm-up, improvisation, alignment, stretching exercises, and traveling combinations. Rhythmic awareness and the relationship of music to dance is stressed throughout."
    }
]